using Plots

function dispersion(k, NN, Φ0, c0, χ, σ, λ, Ds, α1, α2)
return -((-2*c0^2*Ds*NN + 4*c0^3*Ds*NN - c0*k^2*λ^2*+
2*c0^2*k^2*λ^2 - 2*c0*Ds*k^2*NN*λ^2 + 
2*c0^2*Ds*k^2*NN*λ^2 + 2*c0^2*Ds*NN*Φ0 + 
c0*k^2*λ^2*Φ0 - c0*k^2*NN*λ^2*Φ0 + 
2*c0*Ds*k^2*NN*λ^2*Φ0 - 
c0*k^4*NN*λ^2*Φ0 + 
2*c0^2*k^4*NN*λ^2*Φ0*+
2*c0^2*k^2*NN*α1*λ^2*Φ0 - 
4*c0^3*k^2*NN*α1*λ^2*Φ0 + 
2*c0^2*k^2*NN*α2*λ^2*Φ0 - 
4*c0^3*k^2*NN*α2*λ^2*Φ0 - 
2*c0*Ds*NN*σ*Φ0 + 6*c0^2*Ds*NN*σ*Φ0 - 
k^2*λ^2*σ*Φ0 + 
3*c0*k^2*λ^2*σ*Φ0 - 
Ds*k^2*NN*λ^2*σ*Φ0 + 
2*c0*Ds*k^2*NN*λ^2*σ*Φ0 - 
c0*NN*σ^2*Φ0 + 2*c0^2*NN*σ^2*Φ0 + 
c0*k^4*NN*λ^2*Φ0^2 - 
2*c0^2*k^2*NN*α1*λ^2*Φ0^2 - 
2*c0^2*k^2*NN*α2*λ^2*Φ0^2 + 
2*c0*Ds*NN*σ*Φ0^2 + 
k^2*λ^2*σ*Φ0^2 - 
k^2*NN*λ^2*σ*Φ0^2 + 
Ds*k^2*NN*λ^2*σ*Φ0^2 - 
k^4*NN*λ^2*σ*Φ0^2 + 
3*c0*k^4*NN*λ^2*σ*Φ0^2 + 
2*c0*k^2*NN*α1*λ^2*σ*Φ0^2 - 
6*c0^2*k^2*NN*α1*λ^2*σ*Φ0^2 + 
4*c0*k^2*NN*α2*λ^2*σ*Φ0^2 - 
10*c0^2*k^2*NN*α2*λ^2*σ*Φ0^2 + 
c0*NN*σ^2*Φ0^2 + 2*c0*Ds*NN*σ^2*Φ0^2 + 
k^2*λ^2*σ^2*Φ0^2 + 
Ds*k^2*NN*λ^2*σ^2*Φ0^2 - 
NN*σ^3*Φ0^2 + 3*c0*NN*σ^3*Φ0^2 + 
k^4*NN*λ^2*σ*Φ0^3 - 
2*c0*k^2*NN*α1*λ^2*σ*Φ0^3 - 
4*c0*k^2*NN*α2*λ^2*σ*Φ0^3 + 
k^4*NN*λ^2*σ^2*Φ0^3 - 
2*c0*k^2*NN*α1*λ^2*σ^2*Φ0^3 + 
2*k^2*NN*α2*λ^2*σ^2*Φ0^3 - 
8*c0*k^2*NN*α2*λ^2*σ^2*Φ0^3 + 
NN*σ^3*Φ0^3 + NN*σ^4*Φ0^3 - 
2*k^2*NN*α2*λ^2*σ^2*Φ0^4 - 
2*k^2*NN*α2*λ^2*σ^3*Φ0^4 + 
2*c0*k^2*NN*λ^2*Φ0*χ - 
4*c0^2*k^2*NN*λ^2*Φ0*χ - 
2*c0*k^2*NN*λ^2*Φ0^2*χ + 
2*k^2*NN*λ^2*σ*Φ0^2*χ - 
6*c0*k^2*NN*λ^2*σ*Φ0^2*χ - 
2*k^2*NN*λ^2*σ*Φ0^3*χ - 
2*k^2*NN*λ^2*σ^2*Φ0^3*χ)/(3*(-c0*NN*
λ^2 + 2*c0^2*NN*λ^2 + c0*NN*λ^2*Φ0 - 
  NN*λ^2*σ*Φ0 + 
  3*c0*NN*λ^2*σ*Φ0 + 
  NN*λ^2*σ*Φ0^2 + 
  NN*λ^2*σ^2*Φ0^2))) + ((-(-2*c0^2*Ds*NN + 4*c0^3*Ds*NN - 
   c0*k^2*λ^2 + 2*c0^2*k^2*λ^2 - 
   2*c0*Ds*k^2*NN*λ^2 + 2*c0^2*Ds*k^2*NN*λ^2 + 
   2*c0^2*Ds*NN*Φ0 + c0*k^2*λ^2*Φ0 - 
   c0*k^2*NN*λ^2*Φ0 + 
   2*c0*Ds*k^2*NN*λ^2*Φ0 - 
   c0*k^4*NN*λ^2*Φ0 + 
   2*c0^2*k^4*NN*λ^2*Φ0 + 
   2*c0^2*k^2*NN*α1*λ^2*Φ0 - 
   4*c0^3*k^2*NN*α1*λ^2*Φ0 + 
   2*c0^2*k^2*NN*α2*λ^2*Φ0 - 
   4*c0^3*k^2*NN*α2*λ^2*Φ0 - 
   2*c0*Ds*NN*σ*Φ0 + 6*c0^2*Ds*NN*σ*Φ0*-
     k^2*λ^2*σ*Φ0 + 
   3*c0*k^2*λ^2*σ*Φ0 - 
   Ds*k^2*NN*λ^2*σ*Φ0 + 
   2*c0*Ds*k^2*NN*λ^2*σ*Φ0 - 
   c0*NN*σ^2*Φ0 + 2*c0^2*NN*σ^2*Φ0 + 
   c0*k^4*NN*λ^2*Φ0^2 - 
   2*c0^2*k^2*NN*α1*λ^2*Φ0^2 - 
   2*c0^2*k^2*NN*α2*λ^2*Φ0^2 + 
   2*c0*Ds*NN*σ*Φ0^2 + 
   k^2*λ^2*σ*Φ0^2 - 
   k^2*NN*λ^2*σ*Φ0^2 + 
   Ds*k^2*NN*λ^2*σ*Φ0^2 - 
   k^4*NN*λ^2*σ*Φ0^2 + 
   3*c0*k^4*NN*λ^2*σ*Φ0^2 + 
   2*c0*k^2*NN*α1*λ^2*σ*Φ0^2 - 
   6*c0^2*k^2*NN*α1*λ^2*σ*Φ0^2 + 
   4*c0*k^2*NN*α2*λ^2*σ*Φ0^2 - 
   10*c0^2*k^2*NN*α2*λ^2*σ*Φ0^2 + 
   c0*NN*σ^2*Φ0^2 + 
   2*c0*Ds*NN*σ^2*Φ0^2 + 
   k^2*λ^2*σ^2*Φ0^2 + 
   Ds*k^2*NN*λ^2*σ^2*Φ0^2 - 
   NN*σ^3*Φ0^2 + 3*c0*NN*σ^3*Φ0^2 + 
   k^4*NN*λ^2*σ*Φ0^3 - 
   2*c0*k^2*NN*α1*λ^2*σ*Φ0^3 - 
   4*c0*k^2*NN*α2*λ^2*σ*Φ0^3 + 
   k^4*NN*λ^2*σ^2*Φ0^3 - 
   2*c0*k^2*NN*α1*λ^2*σ^2*Φ0^3 + 
   2*k^2*NN*α2*λ^2*σ^2*Φ0^3 - 
   8*c0*k^2*NN*α2*λ^2*σ^2*Φ0^3 + 
   NN*σ^3*Φ0^3 + NN*σ^4*Φ0^3 - 
   2*k^2*NN*α2*λ^2*σ^2*Φ0^4 - 
   2*k^2*NN*α2*λ^2*σ^3*Φ0^4 + 
   2*c0*k^2*NN*λ^2*Φ0*χ - 
   4*c0^2*k^2*NN*λ^2*Φ0*χ - 
   2*c0*k^2*NN*λ^2*Φ0^2*χ + 
   2*k^2*NN*λ^2*σ*Φ0^2*χ - 
   6*c0*k^2*NN*λ^2*σ*Φ0^2*χ - 
   2*k^2*NN*λ^2*σ*Φ0^3*χ - 
   2*k^2*NN*λ^2*σ^2*Φ0^3*χ)^2 + 
3*(-c0*NN*λ^2 + 2*c0^2*NN*λ^2 + 
   c0*NN*λ^2*Φ0 - 
   NN*λ^2*σ*Φ0 + 
   3*c0*NN*λ^2*σ*Φ0 + 
   NN*λ^2*σ*Φ0^2 + 
   NN*λ^2*σ^2*Φ0^2)*(-2*c0^2*Ds*k^2 + 
   4*c0^3*Ds*k^2 - 2*c0^2*Ds^2*k^2*NN + 4*c0^3*Ds^2*k^2*NN - 
   2*c0*Ds*k^4*λ^2 + 2*c0^2*Ds*k^4*λ^2 - 
   c0*Ds^2*k^4*NN*λ^2 + 2*c0^2*Ds*k^2*Φ0 - 
   2*c0^2*Ds*k^2*NN*Φ0 + 2*c0^2*Ds^2*k^2*NN*Φ0 - 
   2*c0^2*Ds*k^4*NN*Φ0 + 4*c0^3*Ds*k^4*NN*Φ0 + 
   4*c0^3*Ds*k^2*NN*α1*Φ0 - 
   8*c0^4*Ds*k^2*NN*α1*Φ0 + 
   4*c0^3*Ds*k^2*NN*α2*Φ0 - 
   8*c0^4*Ds*k^2*NN*α2*Φ0 + 
   2*c0*Ds*k^4*λ^2*Φ0 - 
   2*c0*Ds*k^4*NN*λ^2*Φ0 + 
   c0*Ds^2*k^4*NN*λ^2*Φ0 - 
   2*c0*Ds*k^6*NN*λ^2*Φ0 + 
   2*c0^2*Ds*k^6*NN*λ^2*Φ0 + 
   4*c0^2*Ds*k^4*NN*α1*λ^2*Φ0 - 
   4*c0^3*Ds*k^4*NN*α1*λ^2*Φ0 + 
   4*c0^2*Ds*k^4*NN*α2*λ^2*Φ0 - 
   4*c0^3*Ds*k^4*NN*α2*λ^2*Φ0 - 
   2*c0*Ds*k^2*σ*Φ0 + 
   6*c0^2*Ds*k^2*σ*Φ0 + 
   4*c0^2*Ds*k^2*NN*σ*Φ0 - 
   c0*Ds^2*k^2*NN*σ*Φ0 + 
   4*c0^2*Ds^2*k^2*NN*σ*Φ0 - 
   Ds*k^4*λ^2*σ*Φ0 + 
   2*c0*Ds*k^4*λ^2*σ*Φ0 - 
   2*c0*Ds*k^2*NN*σ^2*Φ0 + 
   2*c0^2*Ds*k^2*NN*σ^2*Φ0 + 
   2*c0^2*Ds*k^4*NN*Φ0^2 - 
   4*c0^3*Ds*k^2*NN*α1*Φ0^2 - 
   4*c0^3*Ds*k^2*NN*α2*Φ0^2 + 
   2*c0*Ds*k^6*NN*λ^2*Φ0^2 - 
   8*c0^2*Ds*k^4*NN*α1*λ^2*Φ0^2 - 
   8*c0^2*Ds*k^4*NN*α2*λ^2*Φ0^2 + 
   2*c0*Ds*k^2*σ*Φ0^2 - 
   2*c0*Ds*k^2*NN*σ*Φ0^2 + 
   c0*Ds^2*k^2*NN*σ*Φ0^2 - 
   2*c0*Ds*k^4*NN*σ*Φ0^2 + 
   6*c0^2*Ds*k^4*NN*σ*Φ0^2 - 
   4*c0^3*Ds*k^2*NN*α1*σ*Φ0^2 + 
   4*c0^2*Ds*k^2*NN*α2*σ*Φ0^2 - 
   12*c0^3*Ds*k^2*NN*α2*σ*Φ0^2 + 
   Ds*k^4*λ^2*σ*Φ0^2 - 
   Ds*k^4*NN*λ^2*σ*Φ0^2 - 
   Ds*k^6*NN*λ^2*σ*Φ0^2 + 
   2*c0*Ds*k^6*NN*λ^2*σ*Φ0^2 + 
   2*c0*Ds*k^4*NN*α1*λ^2*σ*Φ0^2 - 
   4*c0^2*Ds*k^4*NN*α1*λ^2*σ*Φ0^2 + 
   6*c0*Ds*k^4*NN*α2*λ^2*σ*Φ0^2 - 
   8*c0^2*Ds*k^4*NN*α2*λ^2*σ*Φ0^2 + 
   2*c0*Ds*k^2*σ^2*Φ0^2 + 
   6*c0*Ds*k^2*NN*σ^2*Φ0^2 + 
   c0*Ds^2*k^2*NN*σ^2*Φ0^2 + 
   Ds*k^4*λ^2*σ^2*Φ0^2 - 
   Ds*k^2*NN*σ^3*Φ0^2 + 
   2*c0*Ds*k^2*NN*σ^3*Φ0^2 + 
   4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^3 - 
   8*c0^3*Ds*k^4*NN*α1^2*λ^2*Φ0^3 + 
   4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^3 - 
   8*c0^3*Ds*k^4*NN*α2^2*λ^2*Φ0^3 + 
   2*c0*Ds*k^4*NN*σ*Φ0^3 - 
   4*c0^2*Ds*k^2*NN*α2*σ*Φ0^3 + 
   Ds*k^6*NN*λ^2*σ*Φ0^3 - 
   6*c0*Ds*k^4*NN*α1*λ^2*σ*Φ0^3 - 
   10*c0*Ds*k^4*NN*α2*λ^2*σ*Φ0^3 + 
   2*c0*Ds*k^4*NN*σ^2*Φ0^3 - 
   4*c0*Ds*k^2*NN*α1*σ^2*Φ0^3 + 
   8*c0^2*Ds*k^2*NN*α1*σ^2*Φ0^3 - 
   4*c0^2*Ds*k^2*NN*α2*σ^2*Φ0^3 + 
   Ds*k^6*NN*λ^2*σ^2*Φ0^3 - 
   2*c0*Ds*k^4*NN*α1*λ^2*σ^2*Φ0^3 + 
   2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^3 - 
   6*c0*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^3 + 
   Ds*k^2*NN*σ^3*Φ0^3 + 
   Ds*k^2*NN*σ^4*Φ0^3 - 
   4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^4 - 
   4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^4 + 
   4*c0*Ds*k^4*NN*α1^2*λ^2*σ*Φ0^4 - 
   12*c0^2*Ds*k^4*NN*α1^2*λ^2*σ*Φ0^4*
+ 4*c0*Ds*k^4*NN*α2^2*λ^2*σ*Φ0^4 - 
   12*c0^2*Ds*k^4*NN*α2^2*λ^2*σ*Φ0^4*
+ 4*c0*Ds*k^2*NN*α1*σ^2*Φ0^4 - 
   2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^4 + 
   4*c0*Ds*k^2*NN*α1*σ^3*Φ0^4 - 
   2*Ds*k^4*NN*α2*λ^2*σ^3*Φ0^4 - 
   4*c0*Ds*k^4*NN*α1^2*λ^2*σ*Φ0^5 - 
   4*c0*Ds*k^4*NN*α2^2*λ^2*σ*Φ0^5 - 
   4*c0*Ds*k^4*NN*α1^2*λ^2*σ^2*Φ0^5*
- 4*c0*Ds*k^4*NN*α2^2*λ^2*σ^2*Φ0^5 + 
   4*c0^2*Ds*k^2*NN*Φ0*χ - 
   8*c0^3*Ds*k^2*NN*Φ0*χ + 
   4*c0*Ds*k^4*NN*λ^2*Φ0*χ - 
   4*c0^2*Ds*k^4*NN*λ^2*Φ0*χ - 
   4*c0^2*Ds*k^2*NN*Φ0^2*χ - 
   4*c0*Ds*k^4*NN*λ^2*Φ0^2*χ + 
   4*c0*Ds*k^2*NN*σ*Φ0^2*χ - 
   12*c0^2*Ds*k^2*NN*σ*Φ0^2*χ + 
   2*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
   4*c0*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
   4*c0*Ds*k^2*NN*σ*Φ0^3*χ - 
   2*Ds*k^4*NN*λ^2*σ*Φ0^3*χ - 
   4*c0*Ds*k^2*NN*σ^2*Φ0^3*χ - 
   2*Ds*k^4*NN*λ^2*σ^2*Φ0^3*χ)))/(3*2^(
2/3)*(-c0*NN*λ^2 + 2*c0^2*NN*λ^2 + 
c0*NN*λ^2*Φ0 - NN*λ^2*σ*Φ0 + 
3*c0*NN*λ^2*σ*Φ0 + 
NN*λ^2*σ*Φ0^2 + 
NN*λ^2*σ^2*Φ0^2)*(-27*(-c0*NN*λ^2 + 
   2*c0^2*NN*λ^2 + c0*NN*λ^2*Φ0 - 
   NN*λ^2*σ*Φ0 + 
   3*c0*NN*λ^2*σ*Φ0 + 
   NN*λ^2*σ*Φ0^2 + 
   NN*λ^2*σ^2*Φ0^2)^2*(-2*c0^2*Ds^2*k^4 + 
   4*c0^3*Ds^2*k^4 - c0*Ds^2*k^6*λ^2 + 
   2*c0^2*Ds^2*k^4*Φ0 - 2*c0^2*Ds^2*k^4*NN*Φ0 - 
   2*c0^2*Ds^2*k^6*NN*Φ0 + 4*c0^3*Ds^2*k^6*NN*Φ0 + 
   4*c0^3*Ds^2*k^4*NN*α1*Φ0 - 
   8*c0^4*Ds^2*k^4*NN*α1*Φ0 + 
   4*c0^3*Ds^2*k^4*NN*α2*Φ0 - 
   8*c0^4*Ds^2*k^4*NN*α2*Φ0 + 
   c0*Ds^2*k^6*λ^2*Φ0 - 
   c0*Ds^2*k^6*NN*λ^2*Φ0 - 
   c0*Ds^2*k^8*NN*λ^2*Φ0 + 
   2*c0^2*Ds^2*k^6*NN*α1*λ^2*Φ0 + 
   2*c0^2*Ds^2*k^6*NN*α2*λ^2*Φ0 - 
   c0*Ds^2*k^4*σ*Φ0 + 
   4*c0^2*Ds^2*k^4*σ*Φ0 + 
   4*c0^2*Ds^2*k^4*NN*σ*Φ0 - 
   c0*Ds^2*k^4*NN*σ^2*Φ0 + 
   2*c0^2*Ds^2*k^6*NN*Φ0^2 - 
   4*c0^3*Ds^2*k^4*NN*α1*Φ0^2 - 
   4*c0^3*Ds^2*k^4*NN*α2*Φ0^2 + 
   c0*Ds^2*k^8*NN*λ^2*Φ0^2 - 
   6*c0^2*Ds^2*k^6*NN*α1*λ^2*Φ0^2 - 
   6*c0^2*Ds^2*k^6*NN*α2*λ^2*Φ0^2 + 
   c0*Ds^2*k^4*σ*Φ0^2 - 
   c0*Ds^2*k^4*NN*σ*Φ0^2 - 
   c0*Ds^2*k^6*NN*σ*Φ0^2 + 
   4*c0^2*Ds^2*k^6*NN*σ*Φ0^2 - 
   2*c0^2*Ds^2*k^4*NN*α1*σ*Φ0^2 + 
   2*c0^2*Ds^2*k^4*NN*α2*σ*Φ0^2 - 
   8*c0^3*Ds^2*k^4*NN*α2*σ*Φ0^2 + 
   2*c0*Ds^2*k^6*NN*α2*λ^2*σ*Φ0^2 + 
   c0*Ds^2*k^4*σ^2*Φ0^2 + 
   3*c0*Ds^2*k^4*NN*σ^2*Φ0^2 + 
   4*c0^3*Ds^2*k^4*NN*α1^2*Φ0^3 - 
   8*c0^4*Ds^2*k^4*NN*α1^2*Φ0^3 - 
   8*c0^3*Ds^2*k^4*NN*α1*α2*Φ0^3 + 
   16*c0^4*Ds^2*k^4*NN*α1*α2*Φ0^3 + 
   4*c0^3*Ds^2*k^4*NN*α2^2*Φ0^3 - 
   8*c0^4*Ds^2*k^4*NN*α2^2*Φ0^3 + 
   4*c0^2*Ds^2*k^6*NN*α1^2*λ^2*Φ0^3 - 
   4*c0^3*Ds^2*k^6*NN*α1^2*λ^2*Φ0^3 - 
   8*c0^3*Ds^2*k^6*NN*α1*α2*λ^2*Φ0^3*
+ 4*c0^2*Ds^2*k^6*NN*α2^2*λ^2*Φ0^3 - 
   4*c0^3*Ds^2*k^6*NN*α2^2*λ^2*Φ0^3 + 
   c0*Ds^2*k^6*NN*σ*Φ0^3 + 
   2*c0^2*Ds^2*k^4*NN*α1*σ*Φ0^3 - 
   2*c0^2*Ds^2*k^4*NN*α2*σ*Φ0^3 - 
   6*c0*Ds^2*k^6*NN*α2*λ^2*σ*Φ0^3 + 
   c0*Ds^2*k^6*NN*σ^2*Φ0^3 + 
   2*c0^2*Ds^2*k^4*NN*α1*σ^2*Φ0^3 - 
   2*c0*Ds^2*k^4*NN*α2*σ^2*Φ0^3 + 
   2*c0^2*Ds^2*k^4*NN*α2*σ^2*Φ0^3 - 
   4*c0^3*Ds^2*k^4*NN*α1^2*Φ0^4 + 
   8*c0^3*Ds^2*k^4*NN*α1*α2*Φ0^4 - 
   4*c0^3*Ds^2*k^4*NN*α2^2*Φ0^4 - 
   4*c0^2*Ds^2*k^6*NN*α1^2*λ^2*Φ0^4 - 
   4*c0^2*Ds^2*k^6*NN*α2^2*λ^2*Φ0^4 + 
   4*c0^2*Ds^2*k^4*NN*α1^2*σ*Φ0^4 - 
   12*c0^3*Ds^2*k^4*NN*α1^2*σ*Φ0^4 - 
   8*c0^2*Ds^2*k^4*NN*α1*α2*σ*Φ0^4 + 
   24*c0^3*Ds^2*k^4*NN*α1*α2*σ*Φ0^4 + 
   4*c0^2*Ds^2*k^4*NN*α2^2*σ*Φ0^4 - 
   12*c0^3*Ds^2*k^4*NN*α2^2*σ*Φ0^4 - 
   8*c0^2*Ds^2*k^6*NN*α1*α2*λ^2*σ*
Φ0^4 + 
   4*c0*Ds^2*k^6*NN*α2^2*λ^2*σ*Φ0^4*
- 8*c0^2*Ds^2*k^6*NN*α2^2*λ^2*σ*Φ0^4 + 
   2*c0*Ds^2*k^4*NN*α2*σ^2*Φ0^4 + 
   2*c0*Ds^2*k^4*NN*α2*σ^3*Φ0^4 - 
   4*c0^2*Ds^2*k^4*NN*α1^2*σ*Φ0^5 + 
   8*c0^2*Ds^2*k^4*NN*α1*α2*σ*Φ0^5 - 
   4*c0^2*Ds^2*k^4*NN*α2^2*σ*Φ0^5 - 
   4*c0*Ds^2*k^6*NN*α2^2*λ^2*σ*Φ0^5*
- 4*c0^2*Ds^2*k^4*NN*α1^2*σ^2*Φ0^5 + 
   8*c0^2*Ds^2*k^4*NN*α1*α2*σ^2*Φ0^5*
- 4*c0^2*Ds^2*k^4*NN*α2^2*σ^2*Φ0^5 - 
   4*c0*Ds^2*k^6*NN*α2^2*λ^2*σ^2*
Φ0^5 + 4*c0^2*Ds^2*k^4*NN*Φ0*χ - 
   8*c0^3*Ds^2*k^4*NN*Φ0*χ + 
   2*c0*Ds^2*k^6*NN*λ^2*Φ0*χ - 
   4*c0^2*Ds^2*k^4*NN*Φ0^2*χ - 
   2*c0*Ds^2*k^6*NN*λ^2*Φ0^2*χ + 
   2*c0*Ds^2*k^4*NN*σ*Φ0^2*χ - 
   8*c0^2*Ds^2*k^4*NN*σ*Φ0^2*χ - 
   2*c0*Ds^2*k^4*NN*σ*Φ0^3*χ - 
   2*c0*Ds^2*k^4*NN*σ^2*Φ0^3*χ) - 
2*(-2*c0^2*Ds*NN + 4*c0^3*Ds*NN - c0*k^2*λ^2 + 
   2*c0^2*k^2*λ^2 - 2*c0*Ds*k^2*NN*λ^2 + 
   2*c0^2*Ds*k^2*NN*λ^2 + 2*c0^2*Ds*NN*Φ0 + 
   c0*k^2*λ^2*Φ0 - c0*k^2*NN*λ^2*Φ0 + 
   2*c0*Ds*k^2*NN*λ^2*Φ0 - 
   c0*k^4*NN*λ^2*Φ0 + 
   2*c0^2*k^4*NN*λ^2*Φ0 + 
   2*c0^2*k^2*NN*α1*λ^2*Φ0 - 
   4*c0^3*k^2*NN*α1*λ^2*Φ0 + 
   2*c0^2*k^2*NN*α2*λ^2*Φ0 - 
   4*c0^3*k^2*NN*α2*λ^2*Φ0 - 
   2*c0*Ds*NN*σ*Φ0 + 6*c0^2*Ds*NN*σ*Φ0*-
     k^2*λ^2*σ*Φ0 + 
   3*c0*k^2*λ^2*σ*Φ0 - 
   Ds*k^2*NN*λ^2*σ*Φ0 + 
   2*c0*Ds*k^2*NN*λ^2*σ*Φ0 - 
   c0*NN*σ^2*Φ0 + 2*c0^2*NN*σ^2*Φ0 + 
   c0*k^4*NN*λ^2*Φ0^2 - 
   2*c0^2*k^2*NN*α1*λ^2*Φ0^2 - 
   2*c0^2*k^2*NN*α2*λ^2*Φ0^2 + 
   2*c0*Ds*NN*σ*Φ0^2 + 
   k^2*λ^2*σ*Φ0^2 - 
   k^2*NN*λ^2*σ*Φ0^2 + 
   Ds*k^2*NN*λ^2*σ*Φ0^2 - 
   k^4*NN*λ^2*σ*Φ0^2 + 
   3*c0*k^4*NN*λ^2*σ*Φ0^2 + 
   2*c0*k^2*NN*α1*λ^2*σ*Φ0^2 - 
   6*c0^2*k^2*NN*α1*λ^2*σ*Φ0^2 + 
   4*c0*k^2*NN*α2*λ^2*σ*Φ0^2 - 
   10*c0^2*k^2*NN*α2*λ^2*σ*Φ0^2 + 
   c0*NN*σ^2*Φ0^2 + 
   2*c0*Ds*NN*σ^2*Φ0^2 + 
   k^2*λ^2*σ^2*Φ0^2 + 
   Ds*k^2*NN*λ^2*σ^2*Φ0^2 - 
   NN*σ^3*Φ0^2 + 3*c0*NN*σ^3*Φ0^2 + 
   k^4*NN*λ^2*σ*Φ0^3 - 
   2*c0*k^2*NN*α1*λ^2*σ*Φ0^3 - 
   4*c0*k^2*NN*α2*λ^2*σ*Φ0^3 + 
   k^4*NN*λ^2*σ^2*Φ0^3 - 
   2*c0*k^2*NN*α1*λ^2*σ^2*Φ0^3 + 
   2*k^2*NN*α2*λ^2*σ^2*Φ0^3 - 
   8*c0*k^2*NN*α2*λ^2*σ^2*Φ0^3 + 
   NN*σ^3*Φ0^3 + NN*σ^4*Φ0^3 - 
   2*k^2*NN*α2*λ^2*σ^2*Φ0^4 - 
   2*k^2*NN*α2*λ^2*σ^3*Φ0^4 + 
   2*c0*k^2*NN*λ^2*Φ0*χ - 
   4*c0^2*k^2*NN*λ^2*Φ0*χ - 
   2*c0*k^2*NN*λ^2*Φ0^2*χ + 
   2*k^2*NN*λ^2*σ*Φ0^2*χ - 
   6*c0*k^2*NN*λ^2*σ*Φ0^2*χ - 
   2*k^2*NN*λ^2*σ*Φ0^3*χ - 
   2*k^2*NN*λ^2*σ^2*Φ0^3*χ)^3 + 
9*(-c0*NN*λ^2 + 2*c0^2*NN*λ^2 + 
   c0*NN*λ^2*Φ0 - 
   NN*λ^2*σ*Φ0 + 
   3*c0*NN*λ^2*σ*Φ0 + 
   NN*λ^2*σ*Φ0^2 + 
   NN*λ^2*σ^2*Φ0^2)*(-2*c0^2*Ds*NN + 
   4*c0^3*Ds*NN - c0*k^2*λ^2 + 2*c0^2*k^2*λ^2 - 
   2*c0*Ds*k^2*NN*λ^2 + 2*c0^2*Ds*k^2*NN*λ^2 + 
   2*c0^2*Ds*NN*Φ0 + c0*k^2*λ^2*Φ0 - 
   c0*k^2*NN*λ^2*Φ0 + 
   2*c0*Ds*k^2*NN*λ^2*Φ0 - 
   c0*k^4*NN*λ^2*Φ0 + 
   2*c0^2*k^4*NN*λ^2*Φ0 + 
   2*c0^2*k^2*NN*α1*λ^2*Φ0 - 
   4*c0^3*k^2*NN*α1*λ^2*Φ0 + 
   2*c0^2*k^2*NN*α2*λ^2*Φ0 - 
   4*c0^3*k^2*NN*α2*λ^2*Φ0 - 
   2*c0*Ds*NN*σ*Φ0 + 6*c0^2*Ds*NN*σ*Φ0*-
     k^2*λ^2*σ*Φ0 + 
   3*c0*k^2*λ^2*σ*Φ0 - 
   Ds*k^2*NN*λ^2*σ*Φ0 + 
   2*c0*Ds*k^2*NN*λ^2*σ*Φ0 - 
   c0*NN*σ^2*Φ0 + 2*c0^2*NN*σ^2*Φ0 + 
   c0*k^4*NN*λ^2*Φ0^2 - 
   2*c0^2*k^2*NN*α1*λ^2*Φ0^2 - 
   2*c0^2*k^2*NN*α2*λ^2*Φ0^2 + 
   2*c0*Ds*NN*σ*Φ0^2 + 
   k^2*λ^2*σ*Φ0^2 - 
   k^2*NN*λ^2*σ*Φ0^2 + 
   Ds*k^2*NN*λ^2*σ*Φ0^2 - 
   k^4*NN*λ^2*σ*Φ0^2 + 
   3*c0*k^4*NN*λ^2*σ*Φ0^2 + 
   2*c0*k^2*NN*α1*λ^2*σ*Φ0^2 - 
   6*c0^2*k^2*NN*α1*λ^2*σ*Φ0^2 + 
   4*c0*k^2*NN*α2*λ^2*σ*Φ0^2 - 
   10*c0^2*k^2*NN*α2*λ^2*σ*Φ0^2 + 
   c0*NN*σ^2*Φ0^2 + 
   2*c0*Ds*NN*σ^2*Φ0^2 + 
   k^2*λ^2*σ^2*Φ0^2 + 
   Ds*k^2*NN*λ^2*σ^2*Φ0^2 - 
   NN*σ^3*Φ0^2 + 3*c0*NN*σ^3*Φ0^2 + 
   k^4*NN*λ^2*σ*Φ0^3 - 
   2*c0*k^2*NN*α1*λ^2*σ*Φ0^3 - 
   4*c0*k^2*NN*α2*λ^2*σ*Φ0^3 + 
   k^4*NN*λ^2*σ^2*Φ0^3 - 
   2*c0*k^2*NN*α1*λ^2*σ^2*Φ0^3 + 
   2*k^2*NN*α2*λ^2*σ^2*Φ0^3 - 
   8*c0*k^2*NN*α2*λ^2*σ^2*Φ0^3 + 
   NN*σ^3*Φ0^3 + NN*σ^4*Φ0^3 - 
   2*k^2*NN*α2*λ^2*σ^2*Φ0^4 - 
   2*k^2*NN*α2*λ^2*σ^3*Φ0^4 + 
   2*c0*k^2*NN*λ^2*Φ0*χ - 
   4*c0^2*k^2*NN*λ^2*Φ0*χ - 
   2*c0*k^2*NN*λ^2*Φ0^2*χ + 
   2*k^2*NN*λ^2*σ*Φ0^2*χ - 
   6*c0*k^2*NN*λ^2*σ*Φ0^2*χ - 
   2*k^2*NN*λ^2*σ*Φ0^3*χ - 
   2*k^2*NN*λ^2*σ^2*Φ0^3*χ)*(-2*c0^2*
Ds*k^2 + 4*c0^3*Ds*k^2 - 2*c0^2*Ds^2*k^2*NN + 4*c0^3*Ds^2*k^2*NN - 
   2*c0*Ds*k^4*λ^2 + 2*c0^2*Ds*k^4*λ^2 - 
   c0*Ds^2*k^4*NN*λ^2 + 2*c0^2*Ds*k^2*Φ0 - 
   2*c0^2*Ds*k^2*NN*Φ0 + 2*c0^2*Ds^2*k^2*NN*Φ0 - 
   2*c0^2*Ds*k^4*NN*Φ0 + 4*c0^3*Ds*k^4*NN*Φ0 + 
   4*c0^3*Ds*k^2*NN*α1*Φ0 - 
   8*c0^4*Ds*k^2*NN*α1*Φ0 + 
   4*c0^3*Ds*k^2*NN*α2*Φ0 - 
   8*c0^4*Ds*k^2*NN*α2*Φ0 + 
   2*c0*Ds*k^4*λ^2*Φ0 - 
   2*c0*Ds*k^4*NN*λ^2*Φ0 + 
   c0*Ds^2*k^4*NN*λ^2*Φ0 - 
   2*c0*Ds*k^6*NN*λ^2*Φ0 + 
   2*c0^2*Ds*k^6*NN*λ^2*Φ0 + 
   4*c0^2*Ds*k^4*NN*α1*λ^2*Φ0 - 
   4*c0^3*Ds*k^4*NN*α1*λ^2*Φ0 + 
   4*c0^2*Ds*k^4*NN*α2*λ^2*Φ0 - 
   4*c0^3*Ds*k^4*NN*α2*λ^2*Φ0 - 
   2*c0*Ds*k^2*σ*Φ0 + 
   6*c0^2*Ds*k^2*σ*Φ0 + 
   4*c0^2*Ds*k^2*NN*σ*Φ0 - 
   c0*Ds^2*k^2*NN*σ*Φ0 + 
   4*c0^2*Ds^2*k^2*NN*σ*Φ0 - 
   Ds*k^4*λ^2*σ*Φ0 + 
   2*c0*Ds*k^4*λ^2*σ*Φ0 - 
   2*c0*Ds*k^2*NN*σ^2*Φ0 + 
   2*c0^2*Ds*k^2*NN*σ^2*Φ0 + 
   2*c0^2*Ds*k^4*NN*Φ0^2 - 
   4*c0^3*Ds*k^2*NN*α1*Φ0^2 - 
   4*c0^3*Ds*k^2*NN*α2*Φ0^2 + 
   2*c0*Ds*k^6*NN*λ^2*Φ0^2 - 
   8*c0^2*Ds*k^4*NN*α1*λ^2*Φ0^2 - 
   8*c0^2*Ds*k^4*NN*α2*λ^2*Φ0^2 + 
   2*c0*Ds*k^2*σ*Φ0^2 - 
   2*c0*Ds*k^2*NN*σ*Φ0^2 + 
   c0*Ds^2*k^2*NN*σ*Φ0^2 - 
   2*c0*Ds*k^4*NN*σ*Φ0^2 + 
   6*c0^2*Ds*k^4*NN*σ*Φ0^2 - 
   4*c0^3*Ds*k^2*NN*α1*σ*Φ0^2 + 
   4*c0^2*Ds*k^2*NN*α2*σ*Φ0^2 - 
   12*c0^3*Ds*k^2*NN*α2*σ*Φ0^2 + 
   Ds*k^4*λ^2*σ*Φ0^2 - 
   Ds*k^4*NN*λ^2*σ*Φ0^2 - 
   Ds*k^6*NN*λ^2*σ*Φ0^2 + 
   2*c0*Ds*k^6*NN*λ^2*σ*Φ0^2 + 
   2*c0*Ds*k^4*NN*α1*λ^2*σ*Φ0^2 - 
   4*c0^2*Ds*k^4*NN*α1*λ^2*σ*Φ0^2 + 
   6*c0*Ds*k^4*NN*α2*λ^2*σ*Φ0^2 - 
   8*c0^2*Ds*k^4*NN*α2*λ^2*σ*Φ0^2 + 
   2*c0*Ds*k^2*σ^2*Φ0^2 + 
   6*c0*Ds*k^2*NN*σ^2*Φ0^2 + 
   c0*Ds^2*k^2*NN*σ^2*Φ0^2 + 
   Ds*k^4*λ^2*σ^2*Φ0^2 - 
   Ds*k^2*NN*σ^3*Φ0^2 + 
   2*c0*Ds*k^2*NN*σ^3*Φ0^2 + 
   4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^3 - 
   8*c0^3*Ds*k^4*NN*α1^2*λ^2*Φ0^3 + 
   4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^3 - 
   8*c0^3*Ds*k^4*NN*α2^2*λ^2*Φ0^3 + 
   2*c0*Ds*k^4*NN*σ*Φ0^3 - 
   4*c0^2*Ds*k^2*NN*α2*σ*Φ0^3 + 
   Ds*k^6*NN*λ^2*σ*Φ0^3 - 
   6*c0*Ds*k^4*NN*α1*λ^2*σ*Φ0^3 - 
   10*c0*Ds*k^4*NN*α2*λ^2*σ*Φ0^3 + 
   2*c0*Ds*k^4*NN*σ^2*Φ0^3 - 
   4*c0*Ds*k^2*NN*α1*σ^2*Φ0^3 + 
   8*c0^2*Ds*k^2*NN*α1*σ^2*Φ0^3 - 
   4*c0^2*Ds*k^2*NN*α2*σ^2*Φ0^3 + 
   Ds*k^6*NN*λ^2*σ^2*Φ0^3 - 
   2*c0*Ds*k^4*NN*α1*λ^2*σ^2*Φ0^3 + 
   2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^3 - 
   6*c0*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^3 + 
   Ds*k^2*NN*σ^3*Φ0^3 + 
   Ds*k^2*NN*σ^4*Φ0^3 - 
   4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^4 - 
   4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^4 + 
   4*c0*Ds*k^4*NN*α1^2*λ^2*σ*Φ0^4 - 
   12*c0^2*Ds*k^4*NN*α1^2*λ^2*σ*Φ0^4*
+ 4*c0*Ds*k^4*NN*α2^2*λ^2*σ*Φ0^4 - 
   12*c0^2*Ds*k^4*NN*α2^2*λ^2*σ*Φ0^4*
+ 4*c0*Ds*k^2*NN*α1*σ^2*Φ0^4 - 
   2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^4 + 
   4*c0*Ds*k^2*NN*α1*σ^3*Φ0^4 - 
   2*Ds*k^4*NN*α2*λ^2*σ^3*Φ0^4 - 
   4*c0*Ds*k^4*NN*α1^2*λ^2*σ*Φ0^5 - 
   4*c0*Ds*k^4*NN*α2^2*λ^2*σ*Φ0^5 - 
   4*c0*Ds*k^4*NN*α1^2*λ^2*σ^2*Φ0^5*
- 4*c0*Ds*k^4*NN*α2^2*λ^2*σ^2*Φ0^5 + 
   4*c0^2*Ds*k^2*NN*Φ0*χ - 
   8*c0^3*Ds*k^2*NN*Φ0*χ + 
   4*c0*Ds*k^4*NN*λ^2*Φ0*χ - 
   4*c0^2*Ds*k^4*NN*λ^2*Φ0*χ - 
   4*c0^2*Ds*k^2*NN*Φ0^2*χ - 
   4*c0*Ds*k^4*NN*λ^2*Φ0^2*χ + 
   4*c0*Ds*k^2*NN*σ*Φ0^2*χ - 
   12*c0^2*Ds*k^2*NN*σ*Φ0^2*χ + 
   2*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
   4*c0*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
   4*c0*Ds*k^2*NN*σ*Φ0^3*χ - 
   2*Ds*k^4*NN*λ^2*σ*Φ0^3*χ - 
   4*c0*Ds*k^2*NN*σ^2*Φ0^3*χ - 
   2*Ds*k^4*NN*λ^2*σ^2*Φ0^3*χ) + 
safesqrt(4*(-(-2*c0^2*Ds*NN + 4*c0^3*Ds*NN - c0*k^2*λ^2 + 
         2*c0^2*k^2*λ^2 - 2*c0*Ds*k^2*NN*λ^2 + 
         2*c0^2*Ds*k^2*NN*λ^2 + 2*c0^2*Ds*NN*Φ0 + 
         c0*k^2*λ^2*Φ0 - 
         c0*k^2*NN*λ^2*Φ0 + 
         2*c0*Ds*k^2*NN*λ^2*Φ0 - 
         c0*k^4*NN*λ^2*Φ0 + 
         2*c0^2*k^4*NN*λ^2*Φ0 + 
         2*c0^2*k^2*NN*α1*λ^2*Φ0 - 
         4*c0^3*k^2*NN*α1*λ^2*Φ0 + 
         2*c0^2*k^2*NN*α2*λ^2*Φ0 - 
         4*c0^3*k^2*NN*α2*λ^2*Φ0 - 
         2*c0*Ds*NN*σ*Φ0 + 
         6*c0^2*Ds*NN*σ*Φ0 - 
         k^2*λ^2*σ*Φ0 + 
         3*c0*k^2*λ^2*σ*Φ0 - 
         Ds*k^2*NN*λ^2*σ*Φ0 + 
         2*c0*Ds*k^2*NN*λ^2*σ*Φ0 - 
         c0*NN*σ^2*Φ0 + 
         2*c0^2*NN*σ^2*Φ0 + 
         c0*k^4*NN*λ^2*Φ0^2 - 
         2*c0^2*k^2*NN*α1*λ^2*Φ0^2 - 
         2*c0^2*k^2*NN*α2*λ^2*Φ0^2 + 
         2*c0*Ds*NN*σ*Φ0^2 + 
         k^2*λ^2*σ*Φ0^2 - 
         k^2*NN*λ^2*σ*Φ0^2 + 
         Ds*k^2*NN*λ^2*σ*Φ0^2 - 
         k^4*NN*λ^2*σ*Φ0^2 + 
         3*c0*k^4*NN*λ^2*σ*Φ0^2 + 
         2*c0*k^2*NN*α1*λ^2*σ*Φ0^2 - 
         6*c0^2*k^2*NN*α1*λ^2*σ*Φ0^2*
+ 4*c0*k^2*NN*α2*λ^2*σ*Φ0^2 - 
         10*c0^2*k^2*NN*α2*λ^2*σ*
Φ0^2 + c0*NN*σ^2*Φ0^2 + 
         2*c0*Ds*NN*σ^2*Φ0^2 + 
         k^2*λ^2*σ^2*Φ0^2 + 
         Ds*k^2*NN*λ^2*σ^2*Φ0^2 - 
         NN*σ^3*Φ0^2 + 
         3*c0*NN*σ^3*Φ0^2 + 
         k^4*NN*λ^2*σ*Φ0^3 - 
         2*c0*k^2*NN*α1*λ^2*σ*Φ0^3 - 
         4*c0*k^2*NN*α2*λ^2*σ*Φ0^3 + 
         k^4*NN*λ^2*σ^2*Φ0^3 - 
         2*c0*k^2*NN*α1*λ^2*σ^2*Φ0^3*
+ 2*k^2*NN*α2*λ^2*σ^2*Φ0^3 - 
         8*c0*k^2*NN*α2*λ^2*σ^2*Φ0^3*
+ NN*σ^3*Φ0^3 + NN*σ^4*Φ0^3 - 
         2*k^2*NN*α2*λ^2*σ^2*Φ0^4 - 
         2*k^2*NN*α2*λ^2*σ^3*Φ0^4 + 
         2*c0*k^2*NN*λ^2*Φ0*χ - 
         4*c0^2*k^2*NN*λ^2*Φ0*χ - 
         2*c0*k^2*NN*λ^2*Φ0^2*χ + 
         2*k^2*NN*λ^2*σ*Φ0^2*χ - 
         6*c0*k^2*NN*λ^2*σ*Φ0^2*χ - 
         2*k^2*NN*λ^2*σ*Φ0^3*χ - 
         2*k^2*NN*λ^2*σ^2*Φ0^3*χ)^2 + 
       3*(-c0*NN*λ^2 + 2*c0^2*NN*λ^2 + 
         c0*NN*λ^2*Φ0 - 
         NN*λ^2*σ*Φ0 + 
         3*c0*NN*λ^2*σ*Φ0 + 
         NN*λ^2*σ*Φ0^2 + 
         NN*λ^2*σ^2*Φ0^2)*(-2*c0^2*Ds*k^2 + 
         4*c0^3*Ds*k^2 - 2*c0^2*Ds^2*k^2*NN + 
         4*c0^3*Ds^2*k^2*NN - 2*c0*Ds*k^4*λ^2 + 
         2*c0^2*Ds*k^4*λ^2 - 
         c0*Ds^2*k^4*NN*λ^2 + 2*c0^2*Ds*k^2*Φ0 - 
         2*c0^2*Ds*k^2*NN*Φ0 + 
         2*c0^2*Ds^2*k^2*NN*Φ0 - 
         2*c0^2*Ds*k^4*NN*Φ0 + 4*c0^3*Ds*k^4*NN*Φ0 + 
         4*c0^3*Ds*k^2*NN*α1*Φ0 - 
         8*c0^4*Ds*k^2*NN*α1*Φ0 + 
         4*c0^3*Ds*k^2*NN*α2*Φ0 - 
         8*c0^4*Ds*k^2*NN*α2*Φ0 + 
         2*c0*Ds*k^4*λ^2*Φ0 - 
         2*c0*Ds*k^4*NN*λ^2*Φ0 + 
         c0*Ds^2*k^4*NN*λ^2*Φ0 - 
         2*c0*Ds*k^6*NN*λ^2*Φ0 + 
         2*c0^2*Ds*k^6*NN*λ^2*Φ0 + 
         4*c0^2*Ds*k^4*NN*α1*λ^2*Φ0 - 
         4*c0^3*Ds*k^4*NN*α1*λ^2*Φ0 + 
         4*c0^2*Ds*k^4*NN*α2*λ^2*Φ0 - 
         4*c0^3*Ds*k^4*NN*α2*λ^2*Φ0 - 
         2*c0*Ds*k^2*σ*Φ0 + 
         6*c0^2*Ds*k^2*σ*Φ0 + 
         4*c0^2*Ds*k^2*NN*σ*Φ0 - 
         c0*Ds^2*k^2*NN*σ*Φ0 + 
         4*c0^2*Ds^2*k^2*NN*σ*Φ0 - 
         Ds*k^4*λ^2*σ*Φ0 + 
         2*c0*Ds*k^4*λ^2*σ*Φ0 - 
         2*c0*Ds*k^2*NN*σ^2*Φ0 + 
         2*c0^2*Ds*k^2*NN*σ^2*Φ0 + 
         2*c0^2*Ds*k^4*NN*Φ0^2 - 
         4*c0^3*Ds*k^2*NN*α1*Φ0^2 - 
         4*c0^3*Ds*k^2*NN*α2*Φ0^2 + 
         2*c0*Ds*k^6*NN*λ^2*Φ0^2 - 
         8*c0^2*Ds*k^4*NN*α1*λ^2*Φ0^2 - 
         8*c0^2*Ds*k^4*NN*α2*λ^2*Φ0^2 + 
         2*c0*Ds*k^2*σ*Φ0^2 - 
         2*c0*Ds*k^2*NN*σ*Φ0^2 + 
         c0*Ds^2*k^2*NN*σ*Φ0^2 - 
         2*c0*Ds*k^4*NN*σ*Φ0^2 + 
         6*c0^2*Ds*k^4*NN*σ*Φ0^2 - 
         4*c0^3*Ds*k^2*NN*α1*σ*Φ0^2 + 
         4*c0^2*Ds*k^2*NN*α2*σ*Φ0^2 - 
         12*c0^3*Ds*k^2*NN*α2*σ*Φ0^2 + 
         Ds*k^4*λ^2*σ*Φ0^2 - 
         Ds*k^4*NN*λ^2*σ*Φ0^2 - 
         Ds*k^6*NN*λ^2*σ*Φ0^2 + 
         2*c0*Ds*k^6*NN*λ^2*σ*Φ0^2 + 
         2*c0*Ds*k^4*NN*α1*λ^2*σ*
Φ0^2 - 
         4*c0^2*Ds*k^4*NN*α1*λ^2*σ*
Φ0^2 + 6*c0*Ds*k^4*NN*α2*λ^2*σ*Φ0^2 - 
         8*c0^2*Ds*k^4*NN*α2*λ^2*σ*
Φ0^2 + 2*c0*Ds*k^2*σ^2*Φ0^2 + 
         6*c0*Ds*k^2*NN*σ^2*Φ0^2 + 
         c0*Ds^2*k^2*NN*σ^2*Φ0^2 + 
         Ds*k^4*λ^2*σ^2*Φ0^2 - 
         Ds*k^2*NN*σ^3*Φ0^2 + 
         2*c0*Ds*k^2*NN*σ^3*Φ0^2 + 
         4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^3 - 
         8*c0^3*Ds*k^4*NN*α1^2*λ^2*Φ0^3 + 
         4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^3 - 
         8*c0^3*Ds*k^4*NN*α2^2*λ^2*Φ0^3 + 
         2*c0*Ds*k^4*NN*σ*Φ0^3 - 
         4*c0^2*Ds*k^2*NN*α2*σ*Φ0^3 + 
         Ds*k^6*NN*λ^2*σ*Φ0^3 - 
         6*c0*Ds*k^4*NN*α1*λ^2*σ*
Φ0^3 - 
         10*c0*Ds*k^4*NN*α2*λ^2*σ*
Φ0^3 + 2*c0*Ds*k^4*NN*σ^2*Φ0^3 - 
         4*c0*Ds*k^2*NN*α1*σ^2*Φ0^3 + 
         8*c0^2*Ds*k^2*NN*α1*σ^2*Φ0^3 - 
         4*c0^2*Ds*k^2*NN*α2*σ^2*Φ0^3 + 
         Ds*k^6*NN*λ^2*σ^2*Φ0^3 - 
         2*c0*Ds*k^4*NN*α1*λ^2*σ^2*
Φ0^3 + 2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^3 - 
         6*c0*Ds*k^4*NN*α2*λ^2*σ^2*
Φ0^3 + Ds*k^2*NN*σ^3*Φ0^3 + 
         Ds*k^2*NN*σ^4*Φ0^3 - 
         4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^4 - 
         4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^4 + 
         4*c0*Ds*k^4*NN*α1^2*λ^2*σ*
Φ0^4 - 
         12*c0^2*Ds*k^4*NN*α1^2*λ^2*σ*
Φ0^4 + 
         4*c0*Ds*k^4*NN*α2^2*λ^2*σ*
Φ0^4 - 
         12*c0^2*Ds*k^4*NN*α2^2*λ^2*σ*
Φ0^4 + 4*c0*Ds*k^2*NN*α1*σ^2*Φ0^4 - 
         2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^4*
+ 4*c0*Ds*k^2*NN*α1*σ^3*Φ0^4 - 
         2*Ds*k^4*NN*α2*λ^2*σ^3*Φ0^4*
- 4*c0*Ds*k^4*NN*α1^2*λ^2*σ*Φ0^5 - 
         4*c0*Ds*k^4*NN*α2^2*λ^2*σ*
Φ0^5 - 
         4*c0*Ds*k^4*NN*α1^2*λ^2*σ^2*
Φ0^5 - 
         4*c0*Ds*k^4*NN*α2^2*λ^2*σ^2*
Φ0^5 + 4*c0^2*Ds*k^2*NN*Φ0*χ - 
         8*c0^3*Ds*k^2*NN*Φ0*χ + 
         4*c0*Ds*k^4*NN*λ^2*Φ0*χ - 
         4*c0^2*Ds*k^4*NN*λ^2*Φ0*χ - 
         4*c0^2*Ds*k^2*NN*Φ0^2*χ - 
         4*c0*Ds*k^4*NN*λ^2*Φ0^2*χ + 
         4*c0*Ds*k^2*NN*σ*Φ0^2*χ - 
         12*c0^2*Ds*k^2*NN*σ*Φ0^2*χ + 
         2*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
         4*c0*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
         4*c0*Ds*k^2*NN*σ*Φ0^3*χ - 
         2*Ds*k^4*NN*λ^2*σ*Φ0^3*χ - 
         4*c0*Ds*k^2*NN*σ^2*Φ0^3*χ - 
         2*Ds*k^4*NN*λ^2*σ^2*Φ0^3*
χ))^3 + (-27*(-c0*NN*λ^2 + 2*c0^2*NN*λ^2 + 
        c0*NN*λ^2*Φ0 - 
        NN*λ^2*σ*Φ0 + 
        3*c0*NN*λ^2*σ*Φ0 + 
        NN*λ^2*σ*Φ0^2 + 
        NN*λ^2*σ^2*Φ0^2)^2*(-2*c0^2*Ds^2*
k^4 + 4*c0^3*Ds^2*k^4 - c0*Ds^2*k^6*λ^2 + 
        2*c0^2*Ds^2*k^4*Φ0 - 2*c0^2*Ds^2*k^4*NN*Φ0 - 
        2*c0^2*Ds^2*k^6*NN*Φ0 + 
        4*c0^3*Ds^2*k^6*NN*Φ0 + 
        4*c0^3*Ds^2*k^4*NN*α1*Φ0 - 
        8*c0^4*Ds^2*k^4*NN*α1*Φ0 + 
        4*c0^3*Ds^2*k^4*NN*α2*Φ0 - 
        8*c0^4*Ds^2*k^4*NN*α2*Φ0 + 
        c0*Ds^2*k^6*λ^2*Φ0 - 
        c0*Ds^2*k^6*NN*λ^2*Φ0 - 
        c0*Ds^2*k^8*NN*λ^2*Φ0 + 
        2*c0^2*Ds^2*k^6*NN*α1*λ^2*Φ0 + 
        2*c0^2*Ds^2*k^6*NN*α2*λ^2*Φ0 - 
        c0*Ds^2*k^4*σ*Φ0 + 
        4*c0^2*Ds^2*k^4*σ*Φ0 + 
        4*c0^2*Ds^2*k^4*NN*σ*Φ0 - 
        c0*Ds^2*k^4*NN*σ^2*Φ0 + 
        2*c0^2*Ds^2*k^6*NN*Φ0^2 - 
        4*c0^3*Ds^2*k^4*NN*α1*Φ0^2 - 
        4*c0^3*Ds^2*k^4*NN*α2*Φ0^2 + 
        c0*Ds^2*k^8*NN*λ^2*Φ0^2 - 
        6*c0^2*Ds^2*k^6*NN*α1*λ^2*Φ0^2 - 
        6*c0^2*Ds^2*k^6*NN*α2*λ^2*Φ0^2 + 
        c0*Ds^2*k^4*σ*Φ0^2 - 
        c0*Ds^2*k^4*NN*σ*Φ0^2 - 
        c0*Ds^2*k^6*NN*σ*Φ0^2 + 
        4*c0^2*Ds^2*k^6*NN*σ*Φ0^2 - 
        2*c0^2*Ds^2*k^4*NN*α1*σ*Φ0^2 + 
        2*c0^2*Ds^2*k^4*NN*α2*σ*Φ0^2 - 
        8*c0^3*Ds^2*k^4*NN*α2*σ*Φ0^2 + 
        2*c0*Ds^2*k^6*NN*α2*λ^2*σ*
Φ0^2 + c0*Ds^2*k^4*σ^2*Φ0^2 + 
        3*c0*Ds^2*k^4*NN*σ^2*Φ0^2 + 
        4*c0^3*Ds^2*k^4*NN*α1^2*Φ0^3 - 
        8*c0^4*Ds^2*k^4*NN*α1^2*Φ0^3 - 
        8*c0^3*Ds^2*k^4*NN*α1*α2*Φ0^3 + 
        16*c0^4*Ds^2*k^4*NN*α1*α2*Φ0^3 + 
        4*c0^3*Ds^2*k^4*NN*α2^2*Φ0^3 - 
        8*c0^4*Ds^2*k^4*NN*α2^2*Φ0^3 + 
        4*c0^2*Ds^2*k^6*NN*α1^2*λ^2*Φ0^3 - 
        4*c0^3*Ds^2*k^6*NN*α1^2*λ^2*Φ0^3 - 
        8*c0^3*Ds^2*k^6*NN*α1*α2*λ^2*
Φ0^3 + 4*c0^2*Ds^2*k^6*NN*α2^2*λ^2*Φ0^3 - 
        4*c0^3*Ds^2*k^6*NN*α2^2*λ^2*Φ0^3 + 
        c0*Ds^2*k^6*NN*σ*Φ0^3 + 
        2*c0^2*Ds^2*k^4*NN*α1*σ*Φ0^3 - 
        2*c0^2*Ds^2*k^4*NN*α2*σ*Φ0^3 - 
        6*c0*Ds^2*k^6*NN*α2*λ^2*σ*
Φ0^3 + c0*Ds^2*k^6*NN*σ^2*Φ0^3 + 
        2*c0^2*Ds^2*k^4*NN*α1*σ^2*Φ0^3 - 
        2*c0*Ds^2*k^4*NN*α2*σ^2*Φ0^3 + 
        2*c0^2*Ds^2*k^4*NN*α2*σ^2*Φ0^3 - 
        4*c0^3*Ds^2*k^4*NN*α1^2*Φ0^4 + 
        8*c0^3*Ds^2*k^4*NN*α1*α2*Φ0^4 - 
        4*c0^3*Ds^2*k^4*NN*α2^2*Φ0^4 - 
        4*c0^2*Ds^2*k^6*NN*α1^2*λ^2*Φ0^4 - 
        4*c0^2*Ds^2*k^6*NN*α2^2*λ^2*Φ0^4 + 
        4*c0^2*Ds^2*k^4*NN*α1^2*σ*Φ0^4 - 
        12*c0^3*Ds^2*k^4*NN*α1^2*σ*Φ0^4 - 
        8*c0^2*Ds^2*k^4*NN*α1*α2*σ*
Φ0^4 + 
        24*c0^3*Ds^2*k^4*NN*α1*α2*σ*
Φ0^4 + 4*c0^2*Ds^2*k^4*NN*α2^2*σ*Φ0^4 - 
        12*c0^3*Ds^2*k^4*NN*α2^2*σ*Φ0^4 - 
        8*c0^2*Ds^2*k^6*NN*α1*α2*λ^2*
σ*Φ0^4 + 
        4*c0*Ds^2*k^6*NN*α2^2*λ^2*σ*
Φ0^4 - 
        8*c0^2*Ds^2*k^6*NN*α2^2*λ^2*σ*
Φ0^4 + 2*c0*Ds^2*k^4*NN*α2*σ^2*Φ0^4 + 
        2*c0*Ds^2*k^4*NN*α2*σ^3*Φ0^4 - 
        4*c0^2*Ds^2*k^4*NN*α1^2*σ*Φ0^5 + 
        8*c0^2*Ds^2*k^4*NN*α1*α2*σ*
Φ0^5 - 4*c0^2*Ds^2*k^4*NN*α2^2*σ*Φ0^5 - 
        4*c0*Ds^2*k^6*NN*α2^2*λ^2*σ*
Φ0^5 - 4*c0^2*Ds^2*k^4*NN*α1^2*σ^2*Φ0^5 + 
        8*c0^2*Ds^2*k^4*NN*α1*α2*σ^2*
Φ0^5 - 4*c0^2*Ds^2*k^4*NN*α2^2*σ^2*Φ0^5 - 
        4*c0*Ds^2*k^6*NN*α2^2*λ^2*σ^2*
Φ0^5 + 4*c0^2*Ds^2*k^4*NN*Φ0*χ - 
        8*c0^3*Ds^2*k^4*NN*Φ0*χ + 
        2*c0*Ds^2*k^6*NN*λ^2*Φ0*χ - 
        4*c0^2*Ds^2*k^4*NN*Φ0^2*χ - 
        2*c0*Ds^2*k^6*NN*λ^2*Φ0^2*χ + 
        2*c0*Ds^2*k^4*NN*σ*Φ0^2*χ - 
        8*c0^2*Ds^2*k^4*NN*σ*Φ0^2*χ - 
        2*c0*Ds^2*k^4*NN*σ*Φ0^3*χ - 
        2*c0*Ds^2*k^4*NN*σ^2*Φ0^3*χ) - 
      2*(-2*c0^2*Ds*NN + 4*c0^3*Ds*NN - c0*k^2*λ^2 + 
        2*c0^2*k^2*λ^2 - 2*c0*Ds*k^2*NN*λ^2 + 
        2*c0^2*Ds*k^2*NN*λ^2 + 2*c0^2*Ds*NN*Φ0 + 
        c0*k^2*λ^2*Φ0 - 
        c0*k^2*NN*λ^2*Φ0 + 
        2*c0*Ds*k^2*NN*λ^2*Φ0 - 
        c0*k^4*NN*λ^2*Φ0 + 
        2*c0^2*k^4*NN*λ^2*Φ0 + 
        2*c0^2*k^2*NN*α1*λ^2*Φ0 - 
        4*c0^3*k^2*NN*α1*λ^2*Φ0 + 
        2*c0^2*k^2*NN*α2*λ^2*Φ0 - 
        4*c0^3*k^2*NN*α2*λ^2*Φ0 - 
        2*c0*Ds*NN*σ*Φ0 + 
        6*c0^2*Ds*NN*σ*Φ0 - 
        k^2*λ^2*σ*Φ0 + 
        3*c0*k^2*λ^2*σ*Φ0 - 
        Ds*k^2*NN*λ^2*σ*Φ0 + 
        2*c0*Ds*k^2*NN*λ^2*σ*Φ0 - 
        c0*NN*σ^2*Φ0 + 
        2*c0^2*NN*σ^2*Φ0 + 
        c0*k^4*NN*λ^2*Φ0^2 - 
        2*c0^2*k^2*NN*α1*λ^2*Φ0^2 - 
        2*c0^2*k^2*NN*α2*λ^2*Φ0^2 + 
        2*c0*Ds*NN*σ*Φ0^2 + 
        k^2*λ^2*σ*Φ0^2 - 
        k^2*NN*λ^2*σ*Φ0^2 + 
        Ds*k^2*NN*λ^2*σ*Φ0^2 - 
        k^4*NN*λ^2*σ*Φ0^2 + 
        3*c0*k^4*NN*λ^2*σ*Φ0^2 + 
        2*c0*k^2*NN*α1*λ^2*σ*Φ0^2 - 
        6*c0^2*k^2*NN*α1*λ^2*σ*Φ0^2*
+ 4*c0*k^2*NN*α2*λ^2*σ*Φ0^2 - 
        10*c0^2*k^2*NN*α2*λ^2*σ*Φ0^2*
+ c0*NN*σ^2*Φ0^2 + 2*c0*Ds*NN*σ^2*Φ0^2 + 
        k^2*λ^2*σ^2*Φ0^2 + 
        Ds*k^2*NN*λ^2*σ^2*Φ0^2 - 
        NN*σ^3*Φ0^2 + 3*c0*NN*σ^3*Φ0^2*+
         k^4*NN*λ^2*σ*Φ0^3 - 
        2*c0*k^2*NN*α1*λ^2*σ*Φ0^3 - 
        4*c0*k^2*NN*α2*λ^2*σ*Φ0^3 + 
        k^4*NN*λ^2*σ^2*Φ0^3 - 
        2*c0*k^2*NN*α1*λ^2*σ^2*Φ0^3*
+ 2*k^2*NN*α2*λ^2*σ^2*Φ0^3 - 
        8*c0*k^2*NN*α2*λ^2*σ^2*Φ0^3*+
         NN*σ^3*Φ0^3 + NN*σ^4*Φ0^3 - 
        2*k^2*NN*α2*λ^2*σ^2*Φ0^4 - 
        2*k^2*NN*α2*λ^2*σ^3*Φ0^4 + 
        2*c0*k^2*NN*λ^2*Φ0*χ - 
        4*c0^2*k^2*NN*λ^2*Φ0*χ - 
        2*c0*k^2*NN*λ^2*Φ0^2*χ + 
        2*k^2*NN*λ^2*σ*Φ0^2*χ - 
        6*c0*k^2*NN*λ^2*σ*Φ0^2*χ - 
        2*k^2*NN*λ^2*σ*Φ0^3*χ - 
        2*k^2*NN*λ^2*σ^2*Φ0^3*χ)^3 + 
      9*(-c0*NN*λ^2 + 2*c0^2*NN*λ^2 + 
        c0*NN*λ^2*Φ0 - 
        NN*λ^2*σ*Φ0 + 
        3*c0*NN*λ^2*σ*Φ0 + 
        NN*λ^2*σ*Φ0^2 + 
        NN*λ^2*σ^2*Φ0^2)*(-2*c0^2*Ds*NN + 
        4*c0^3*Ds*NN - c0*k^2*λ^2 + 
        2*c0^2*k^2*λ^2 - 2*c0*Ds*k^2*NN*λ^2 + 
        2*c0^2*Ds*k^2*NN*λ^2 + 2*c0^2*Ds*NN*Φ0 + 
        c0*k^2*λ^2*Φ0 - 
        c0*k^2*NN*λ^2*Φ0 + 
        2*c0*Ds*k^2*NN*λ^2*Φ0 - 
        c0*k^4*NN*λ^2*Φ0 + 
        2*c0^2*k^4*NN*λ^2*Φ0 + 
        2*c0^2*k^2*NN*α1*λ^2*Φ0 - 
        4*c0^3*k^2*NN*α1*λ^2*Φ0 + 
        2*c0^2*k^2*NN*α2*λ^2*Φ0 - 
        4*c0^3*k^2*NN*α2*λ^2*Φ0 - 
        2*c0*Ds*NN*σ*Φ0 + 
        6*c0^2*Ds*NN*σ*Φ0 - 
        k^2*λ^2*σ*Φ0 + 
        3*c0*k^2*λ^2*σ*Φ0 - 
        Ds*k^2*NN*λ^2*σ*Φ0 + 
        2*c0*Ds*k^2*NN*λ^2*σ*Φ0 - 
        c0*NN*σ^2*Φ0 + 
        2*c0^2*NN*σ^2*Φ0 + 
        c0*k^4*NN*λ^2*Φ0^2 - 
        2*c0^2*k^2*NN*α1*λ^2*Φ0^2 - 
        2*c0^2*k^2*NN*α2*λ^2*Φ0^2 + 
        2*c0*Ds*NN*σ*Φ0^2 + 
        k^2*λ^2*σ*Φ0^2 - 
        k^2*NN*λ^2*σ*Φ0^2 + 
        Ds*k^2*NN*λ^2*σ*Φ0^2 - 
        k^4*NN*λ^2*σ*Φ0^2 + 
        3*c0*k^4*NN*λ^2*σ*Φ0^2 + 
        2*c0*k^2*NN*α1*λ^2*σ*Φ0^2 - 
        6*c0^2*k^2*NN*α1*λ^2*σ*Φ0^2*
+ 4*c0*k^2*NN*α2*λ^2*σ*Φ0^2 - 
        10*c0^2*k^2*NN*α2*λ^2*σ*Φ0^2*
+ c0*NN*σ^2*Φ0^2 + 2*c0*Ds*NN*σ^2*Φ0^2 + 
        k^2*λ^2*σ^2*Φ0^2 + 
        Ds*k^2*NN*λ^2*σ^2*Φ0^2 - 
        NN*σ^3*Φ0^2 + 3*c0*NN*σ^3*Φ0^2*+
         k^4*NN*λ^2*σ*Φ0^3 - 
        2*c0*k^2*NN*α1*λ^2*σ*Φ0^3 - 
        4*c0*k^2*NN*α2*λ^2*σ*Φ0^3 + 
        k^4*NN*λ^2*σ^2*Φ0^3 - 
        2*c0*k^2*NN*α1*λ^2*σ^2*Φ0^3*
+ 2*k^2*NN*α2*λ^2*σ^2*Φ0^3 - 
        8*c0*k^2*NN*α2*λ^2*σ^2*Φ0^3*+
         NN*σ^3*Φ0^3 + NN*σ^4*Φ0^3 - 
        2*k^2*NN*α2*λ^2*σ^2*Φ0^4 - 
        2*k^2*NN*α2*λ^2*σ^3*Φ0^4 + 
        2*c0*k^2*NN*λ^2*Φ0*χ - 
        4*c0^2*k^2*NN*λ^2*Φ0*χ - 
        2*c0*k^2*NN*λ^2*Φ0^2*χ + 
        2*k^2*NN*λ^2*σ*Φ0^2*χ - 
        6*c0*k^2*NN*λ^2*σ*Φ0^2*χ - 
        2*k^2*NN*λ^2*σ*Φ0^3*χ - 
        2*k^2*NN*λ^2*σ^2*Φ0^3*χ)*(-2*
c0^2*Ds*k^2 + 4*c0^3*Ds*k^2 - 2*c0^2*Ds^2*k^2*NN + 
        4*c0^3*Ds^2*k^2*NN - 2*c0*Ds*k^4*λ^2 + 
        2*c0^2*Ds*k^4*λ^2 - 
        c0*Ds^2*k^4*NN*λ^2 + 2*c0^2*Ds*k^2*Φ0 - 
        2*c0^2*Ds*k^2*NN*Φ0 + 2*c0^2*Ds^2*k^2*NN*Φ0 - 
        2*c0^2*Ds*k^4*NN*Φ0 + 4*c0^3*Ds*k^4*NN*Φ0 + 
        4*c0^3*Ds*k^2*NN*α1*Φ0 - 
        8*c0^4*Ds*k^2*NN*α1*Φ0 + 
        4*c0^3*Ds*k^2*NN*α2*Φ0 - 
        8*c0^4*Ds*k^2*NN*α2*Φ0 + 
        2*c0*Ds*k^4*λ^2*Φ0 - 
        2*c0*Ds*k^4*NN*λ^2*Φ0 + 
        c0*Ds^2*k^4*NN*λ^2*Φ0 - 
        2*c0*Ds*k^6*NN*λ^2*Φ0 + 
        2*c0^2*Ds*k^6*NN*λ^2*Φ0 + 
        4*c0^2*Ds*k^4*NN*α1*λ^2*Φ0 - 
        4*c0^3*Ds*k^4*NN*α1*λ^2*Φ0 + 
        4*c0^2*Ds*k^4*NN*α2*λ^2*Φ0 - 
        4*c0^3*Ds*k^4*NN*α2*λ^2*Φ0 - 
        2*c0*Ds*k^2*σ*Φ0 + 
        6*c0^2*Ds*k^2*σ*Φ0 + 
        4*c0^2*Ds*k^2*NN*σ*Φ0 - 
        c0*Ds^2*k^2*NN*σ*Φ0 + 
        4*c0^2*Ds^2*k^2*NN*σ*Φ0 - 
        Ds*k^4*λ^2*σ*Φ0 + 
        2*c0*Ds*k^4*λ^2*σ*Φ0 - 
        2*c0*Ds*k^2*NN*σ^2*Φ0 + 
        2*c0^2*Ds*k^2*NN*σ^2*Φ0 + 
        2*c0^2*Ds*k^4*NN*Φ0^2 - 
        4*c0^3*Ds*k^2*NN*α1*Φ0^2 - 
        4*c0^3*Ds*k^2*NN*α2*Φ0^2 + 
        2*c0*Ds*k^6*NN*λ^2*Φ0^2 - 
        8*c0^2*Ds*k^4*NN*α1*λ^2*Φ0^2 - 
        8*c0^2*Ds*k^4*NN*α2*λ^2*Φ0^2 + 
        2*c0*Ds*k^2*σ*Φ0^2 - 
        2*c0*Ds*k^2*NN*σ*Φ0^2 + 
        c0*Ds^2*k^2*NN*σ*Φ0^2 - 
        2*c0*Ds*k^4*NN*σ*Φ0^2 + 
        6*c0^2*Ds*k^4*NN*σ*Φ0^2 - 
        4*c0^3*Ds*k^2*NN*α1*σ*Φ0^2 + 
        4*c0^2*Ds*k^2*NN*α2*σ*Φ0^2 - 
        12*c0^3*Ds*k^2*NN*α2*σ*Φ0^2 + 
        Ds*k^4*λ^2*σ*Φ0^2 - 
        Ds*k^4*NN*λ^2*σ*Φ0^2 - 
        Ds*k^6*NN*λ^2*σ*Φ0^2 + 
        2*c0*Ds*k^6*NN*λ^2*σ*Φ0^2 + 
        2*c0*Ds*k^4*NN*α1*λ^2*σ*Φ0^2*
- 4*c0^2*Ds*k^4*NN*α1*λ^2*σ*Φ0^2 + 
        6*c0*Ds*k^4*NN*α2*λ^2*σ*Φ0^2*
- 8*c0^2*Ds*k^4*NN*α2*λ^2*σ*Φ0^2 + 
        2*c0*Ds*k^2*σ^2*Φ0^2 + 
        6*c0*Ds*k^2*NN*σ^2*Φ0^2 + 
        c0*Ds^2*k^2*NN*σ^2*Φ0^2 + 
        Ds*k^4*λ^2*σ^2*Φ0^2 - 
        Ds*k^2*NN*σ^3*Φ0^2 + 
        2*c0*Ds*k^2*NN*σ^3*Φ0^2 + 
        4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^3 - 
        8*c0^3*Ds*k^4*NN*α1^2*λ^2*Φ0^3 + 
        4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^3 - 
        8*c0^3*Ds*k^4*NN*α2^2*λ^2*Φ0^3 + 
        2*c0*Ds*k^4*NN*σ*Φ0^3 - 
        4*c0^2*Ds*k^2*NN*α2*σ*Φ0^3 + 
        Ds*k^6*NN*λ^2*σ*Φ0^3 - 
        6*c0*Ds*k^4*NN*α1*λ^2*σ*Φ0^3*
- 10*c0*Ds*k^4*NN*α2*λ^2*σ*Φ0^3 + 
        2*c0*Ds*k^4*NN*σ^2*Φ0^3 - 
        4*c0*Ds*k^2*NN*α1*σ^2*Φ0^3 + 
        8*c0^2*Ds*k^2*NN*α1*σ^2*Φ0^3 - 
        4*c0^2*Ds*k^2*NN*α2*σ^2*Φ0^3 + 
        Ds*k^6*NN*λ^2*σ^2*Φ0^3 - 
        2*c0*Ds*k^4*NN*α1*λ^2*σ^2*
Φ0^3 + 2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^3 - 
        6*c0*Ds*k^4*NN*α2*λ^2*σ^2*
Φ0^3 + Ds*k^2*NN*σ^3*Φ0^3 + 
        Ds*k^2*NN*σ^4*Φ0^3 - 
        4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^4 - 
        4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^4 + 
        4*c0*Ds*k^4*NN*α1^2*λ^2*σ*
Φ0^4 - 
        12*c0^2*Ds*k^4*NN*α1^2*λ^2*σ*
Φ0^4 + 
        4*c0*Ds*k^4*NN*α2^2*λ^2*σ*
Φ0^4 - 
        12*c0^2*Ds*k^4*NN*α2^2*λ^2*σ*
Φ0^4 + 4*c0*Ds*k^2*NN*α1*σ^2*Φ0^4 - 
        2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^4*
+ 4*c0*Ds*k^2*NN*α1*σ^3*Φ0^4 - 
        2*Ds*k^4*NN*α2*λ^2*σ^3*Φ0^4*
- 4*c0*Ds*k^4*NN*α1^2*λ^2*σ*Φ0^5 - 
        4*c0*Ds*k^4*NN*α2^2*λ^2*σ*
Φ0^5 - 
        4*c0*Ds*k^4*NN*α1^2*λ^2*σ^2*
Φ0^5 - 
        4*c0*Ds*k^4*NN*α2^2*λ^2*σ^2*
Φ0^5 + 4*c0^2*Ds*k^2*NN*Φ0*χ - 
        8*c0^3*Ds*k^2*NN*Φ0*χ + 
        4*c0*Ds*k^4*NN*λ^2*Φ0*χ - 
        4*c0^2*Ds*k^4*NN*λ^2*Φ0*χ - 
        4*c0^2*Ds*k^2*NN*Φ0^2*χ - 
        4*c0*Ds*k^4*NN*λ^2*Φ0^2*χ + 
        4*c0*Ds*k^2*NN*σ*Φ0^2*χ - 
        12*c0^2*Ds*k^2*NN*σ*Φ0^2*χ + 
        2*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
        4*c0*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
        4*c0*Ds*k^2*NN*σ*Φ0^3*χ - 
        2*Ds*k^4*NN*λ^2*σ*Φ0^3*χ - 
        4*c0*Ds*k^2*NN*σ^2*Φ0^3*χ - 
        
        2*Ds*k^4*NN*λ^2*σ^2*Φ0^3*
χ))^2))^(
1/3)) - ((-27*(-c0*NN*λ^2 + 2*c0^2*NN*λ^2 + 
   c0*NN*λ^2*Φ0 - 
   NN*λ^2*σ*Φ0 + 
   3*c0*NN*λ^2*σ*Φ0 + 
   NN*λ^2*σ*Φ0^2 + 
   NN*λ^2*σ^2*Φ0^2)^2*(-2*c0^2*Ds^2*k^4 + 
   4*c0^3*Ds^2*k^4 - c0*Ds^2*k^6*λ^2 + 
   2*c0^2*Ds^2*k^4*Φ0 - 2*c0^2*Ds^2*k^4*NN*Φ0 - 
   2*c0^2*Ds^2*k^6*NN*Φ0 + 4*c0^3*Ds^2*k^6*NN*Φ0 + 
   4*c0^3*Ds^2*k^4*NN*α1*Φ0 - 
   8*c0^4*Ds^2*k^4*NN*α1*Φ0 + 
   4*c0^3*Ds^2*k^4*NN*α2*Φ0 - 
   8*c0^4*Ds^2*k^4*NN*α2*Φ0 + 
   c0*Ds^2*k^6*λ^2*Φ0 - 
   c0*Ds^2*k^6*NN*λ^2*Φ0 - 
   c0*Ds^2*k^8*NN*λ^2*Φ0 + 
   2*c0^2*Ds^2*k^6*NN*α1*λ^2*Φ0 + 
   2*c0^2*Ds^2*k^6*NN*α2*λ^2*Φ0 - 
   c0*Ds^2*k^4*σ*Φ0 + 
   4*c0^2*Ds^2*k^4*σ*Φ0 + 
   4*c0^2*Ds^2*k^4*NN*σ*Φ0 - 
   c0*Ds^2*k^4*NN*σ^2*Φ0 + 
   2*c0^2*Ds^2*k^6*NN*Φ0^2 - 
   4*c0^3*Ds^2*k^4*NN*α1*Φ0^2 - 
   4*c0^3*Ds^2*k^4*NN*α2*Φ0^2 + 
   c0*Ds^2*k^8*NN*λ^2*Φ0^2 - 
   6*c0^2*Ds^2*k^6*NN*α1*λ^2*Φ0^2 - 
   6*c0^2*Ds^2*k^6*NN*α2*λ^2*Φ0^2 + 
   c0*Ds^2*k^4*σ*Φ0^2 - 
   c0*Ds^2*k^4*NN*σ*Φ0^2 - 
   c0*Ds^2*k^6*NN*σ*Φ0^2 + 
   4*c0^2*Ds^2*k^6*NN*σ*Φ0^2 - 
   2*c0^2*Ds^2*k^4*NN*α1*σ*Φ0^2 + 
   2*c0^2*Ds^2*k^4*NN*α2*σ*Φ0^2 - 
   8*c0^3*Ds^2*k^4*NN*α2*σ*Φ0^2 + 
   2*c0*Ds^2*k^6*NN*α2*λ^2*σ*Φ0^2 + 
   c0*Ds^2*k^4*σ^2*Φ0^2 + 
   3*c0*Ds^2*k^4*NN*σ^2*Φ0^2 + 
   4*c0^3*Ds^2*k^4*NN*α1^2*Φ0^3 - 
   8*c0^4*Ds^2*k^4*NN*α1^2*Φ0^3 - 
   8*c0^3*Ds^2*k^4*NN*α1*α2*Φ0^3 + 
   16*c0^4*Ds^2*k^4*NN*α1*α2*Φ0^3 + 
   4*c0^3*Ds^2*k^4*NN*α2^2*Φ0^3 - 
   8*c0^4*Ds^2*k^4*NN*α2^2*Φ0^3 + 
   4*c0^2*Ds^2*k^6*NN*α1^2*λ^2*Φ0^3 - 
   4*c0^3*Ds^2*k^6*NN*α1^2*λ^2*Φ0^3 - 
   8*c0^3*Ds^2*k^6*NN*α1*α2*λ^2*Φ0^3*
+ 4*c0^2*Ds^2*k^6*NN*α2^2*λ^2*Φ0^3 - 
   4*c0^3*Ds^2*k^6*NN*α2^2*λ^2*Φ0^3 + 
   c0*Ds^2*k^6*NN*σ*Φ0^3 + 
   2*c0^2*Ds^2*k^4*NN*α1*σ*Φ0^3 - 
   2*c0^2*Ds^2*k^4*NN*α2*σ*Φ0^3 - 
   6*c0*Ds^2*k^6*NN*α2*λ^2*σ*Φ0^3 + 
   c0*Ds^2*k^6*NN*σ^2*Φ0^3 + 
   2*c0^2*Ds^2*k^4*NN*α1*σ^2*Φ0^3 - 
   2*c0*Ds^2*k^4*NN*α2*σ^2*Φ0^3 + 
   2*c0^2*Ds^2*k^4*NN*α2*σ^2*Φ0^3 - 
   4*c0^3*Ds^2*k^4*NN*α1^2*Φ0^4 + 
   8*c0^3*Ds^2*k^4*NN*α1*α2*Φ0^4 - 
   4*c0^3*Ds^2*k^4*NN*α2^2*Φ0^4 - 
   4*c0^2*Ds^2*k^6*NN*α1^2*λ^2*Φ0^4 - 
   4*c0^2*Ds^2*k^6*NN*α2^2*λ^2*Φ0^4 + 
   4*c0^2*Ds^2*k^4*NN*α1^2*σ*Φ0^4 - 
   12*c0^3*Ds^2*k^4*NN*α1^2*σ*Φ0^4 - 
   8*c0^2*Ds^2*k^4*NN*α1*α2*σ*Φ0^4 + 
   24*c0^3*Ds^2*k^4*NN*α1*α2*σ*Φ0^4 + 
   4*c0^2*Ds^2*k^4*NN*α2^2*σ*Φ0^4 - 
   12*c0^3*Ds^2*k^4*NN*α2^2*σ*Φ0^4 - 
   8*c0^2*Ds^2*k^6*NN*α1*α2*λ^2*σ*
Φ0^4 + 
   4*c0*Ds^2*k^6*NN*α2^2*λ^2*σ*Φ0^4*
- 8*c0^2*Ds^2*k^6*NN*α2^2*λ^2*σ*Φ0^4 + 
   2*c0*Ds^2*k^4*NN*α2*σ^2*Φ0^4 + 
   2*c0*Ds^2*k^4*NN*α2*σ^3*Φ0^4 - 
   4*c0^2*Ds^2*k^4*NN*α1^2*σ*Φ0^5 + 
   8*c0^2*Ds^2*k^4*NN*α1*α2*σ*Φ0^5 - 
   4*c0^2*Ds^2*k^4*NN*α2^2*σ*Φ0^5 - 
   4*c0*Ds^2*k^6*NN*α2^2*λ^2*σ*Φ0^5*
- 4*c0^2*Ds^2*k^4*NN*α1^2*σ^2*Φ0^5 + 
   8*c0^2*Ds^2*k^4*NN*α1*α2*σ^2*Φ0^5*
- 4*c0^2*Ds^2*k^4*NN*α2^2*σ^2*Φ0^5 - 
   4*c0*Ds^2*k^6*NN*α2^2*λ^2*σ^2*
Φ0^5 + 4*c0^2*Ds^2*k^4*NN*Φ0*χ - 
   8*c0^3*Ds^2*k^4*NN*Φ0*χ + 
   2*c0*Ds^2*k^6*NN*λ^2*Φ0*χ - 
   4*c0^2*Ds^2*k^4*NN*Φ0^2*χ - 
   2*c0*Ds^2*k^6*NN*λ^2*Φ0^2*χ + 
   2*c0*Ds^2*k^4*NN*σ*Φ0^2*χ - 
   8*c0^2*Ds^2*k^4*NN*σ*Φ0^2*χ - 
   2*c0*Ds^2*k^4*NN*σ*Φ0^3*χ - 
   2*c0*Ds^2*k^4*NN*σ^2*Φ0^3*χ) - 
2*(-2*c0^2*Ds*NN + 4*c0^3*Ds*NN - c0*k^2*λ^2 + 
   2*c0^2*k^2*λ^2 - 2*c0*Ds*k^2*NN*λ^2 + 
   2*c0^2*Ds*k^2*NN*λ^2 + 2*c0^2*Ds*NN*Φ0 + 
   c0*k^2*λ^2*Φ0 - c0*k^2*NN*λ^2*Φ0 + 
   2*c0*Ds*k^2*NN*λ^2*Φ0 - 
   c0*k^4*NN*λ^2*Φ0 + 
   2*c0^2*k^4*NN*λ^2*Φ0 + 
   2*c0^2*k^2*NN*α1*λ^2*Φ0 - 
   4*c0^3*k^2*NN*α1*λ^2*Φ0 + 
   2*c0^2*k^2*NN*α2*λ^2*Φ0 - 
   4*c0^3*k^2*NN*α2*λ^2*Φ0 - 
   2*c0*Ds*NN*σ*Φ0 + 6*c0^2*Ds*NN*σ*Φ0*-
     k^2*λ^2*σ*Φ0 + 
   3*c0*k^2*λ^2*σ*Φ0 - 
   Ds*k^2*NN*λ^2*σ*Φ0 + 
   2*c0*Ds*k^2*NN*λ^2*σ*Φ0 - 
   c0*NN*σ^2*Φ0 + 2*c0^2*NN*σ^2*Φ0 + 
   c0*k^4*NN*λ^2*Φ0^2 - 
   2*c0^2*k^2*NN*α1*λ^2*Φ0^2 - 
   2*c0^2*k^2*NN*α2*λ^2*Φ0^2 + 
   2*c0*Ds*NN*σ*Φ0^2 + 
   k^2*λ^2*σ*Φ0^2 - 
   k^2*NN*λ^2*σ*Φ0^2 + 
   Ds*k^2*NN*λ^2*σ*Φ0^2 - 
   k^4*NN*λ^2*σ*Φ0^2 + 
   3*c0*k^4*NN*λ^2*σ*Φ0^2 + 
   2*c0*k^2*NN*α1*λ^2*σ*Φ0^2 - 
   6*c0^2*k^2*NN*α1*λ^2*σ*Φ0^2 + 
   4*c0*k^2*NN*α2*λ^2*σ*Φ0^2 - 
   10*c0^2*k^2*NN*α2*λ^2*σ*Φ0^2 + 
   c0*NN*σ^2*Φ0^2 + 
   2*c0*Ds*NN*σ^2*Φ0^2 + 
   k^2*λ^2*σ^2*Φ0^2 + 
   Ds*k^2*NN*λ^2*σ^2*Φ0^2 - 
   NN*σ^3*Φ0^2 + 3*c0*NN*σ^3*Φ0^2 + 
   k^4*NN*λ^2*σ*Φ0^3 - 
   2*c0*k^2*NN*α1*λ^2*σ*Φ0^3 - 
   4*c0*k^2*NN*α2*λ^2*σ*Φ0^3 + 
   k^4*NN*λ^2*σ^2*Φ0^3 - 
   2*c0*k^2*NN*α1*λ^2*σ^2*Φ0^3 + 
   2*k^2*NN*α2*λ^2*σ^2*Φ0^3 - 
   8*c0*k^2*NN*α2*λ^2*σ^2*Φ0^3 + 
   NN*σ^3*Φ0^3 + NN*σ^4*Φ0^3 - 
   2*k^2*NN*α2*λ^2*σ^2*Φ0^4 - 
   2*k^2*NN*α2*λ^2*σ^3*Φ0^4 + 
   2*c0*k^2*NN*λ^2*Φ0*χ - 
   4*c0^2*k^2*NN*λ^2*Φ0*χ - 
   2*c0*k^2*NN*λ^2*Φ0^2*χ + 
   2*k^2*NN*λ^2*σ*Φ0^2*χ - 
   6*c0*k^2*NN*λ^2*σ*Φ0^2*χ - 
   2*k^2*NN*λ^2*σ*Φ0^3*χ - 
   2*k^2*NN*λ^2*σ^2*Φ0^3*χ)^3 + 
9*(-c0*NN*λ^2 + 2*c0^2*NN*λ^2 + 
   c0*NN*λ^2*Φ0 - 
   NN*λ^2*σ*Φ0 + 
   3*c0*NN*λ^2*σ*Φ0 + 
   NN*λ^2*σ*Φ0^2 + 
   NN*λ^2*σ^2*Φ0^2)*(-2*c0^2*Ds*NN + 
   4*c0^3*Ds*NN - c0*k^2*λ^2 + 2*c0^2*k^2*λ^2 - 
   2*c0*Ds*k^2*NN*λ^2 + 2*c0^2*Ds*k^2*NN*λ^2 + 
   2*c0^2*Ds*NN*Φ0 + c0*k^2*λ^2*Φ0 - 
   c0*k^2*NN*λ^2*Φ0 + 
   2*c0*Ds*k^2*NN*λ^2*Φ0 - 
   c0*k^4*NN*λ^2*Φ0 + 
   2*c0^2*k^4*NN*λ^2*Φ0 + 
   2*c0^2*k^2*NN*α1*λ^2*Φ0 - 
   4*c0^3*k^2*NN*α1*λ^2*Φ0 + 
   2*c0^2*k^2*NN*α2*λ^2*Φ0 - 
   4*c0^3*k^2*NN*α2*λ^2*Φ0 - 
   2*c0*Ds*NN*σ*Φ0 + 6*c0^2*Ds*NN*σ*Φ0*-
     k^2*λ^2*σ*Φ0 + 
   3*c0*k^2*λ^2*σ*Φ0 - 
   Ds*k^2*NN*λ^2*σ*Φ0 + 
   2*c0*Ds*k^2*NN*λ^2*σ*Φ0 - 
   c0*NN*σ^2*Φ0 + 2*c0^2*NN*σ^2*Φ0 + 
   c0*k^4*NN*λ^2*Φ0^2 - 
   2*c0^2*k^2*NN*α1*λ^2*Φ0^2 - 
   2*c0^2*k^2*NN*α2*λ^2*Φ0^2 + 
   2*c0*Ds*NN*σ*Φ0^2 + 
   k^2*λ^2*σ*Φ0^2 - 
   k^2*NN*λ^2*σ*Φ0^2 + 
   Ds*k^2*NN*λ^2*σ*Φ0^2 - 
   k^4*NN*λ^2*σ*Φ0^2 + 
   3*c0*k^4*NN*λ^2*σ*Φ0^2 + 
   2*c0*k^2*NN*α1*λ^2*σ*Φ0^2 - 
   6*c0^2*k^2*NN*α1*λ^2*σ*Φ0^2 + 
   4*c0*k^2*NN*α2*λ^2*σ*Φ0^2 - 
   10*c0^2*k^2*NN*α2*λ^2*σ*Φ0^2 + 
   c0*NN*σ^2*Φ0^2 + 
   2*c0*Ds*NN*σ^2*Φ0^2 + 
   k^2*λ^2*σ^2*Φ0^2 + 
   Ds*k^2*NN*λ^2*σ^2*Φ0^2 - 
   NN*σ^3*Φ0^2 + 3*c0*NN*σ^3*Φ0^2 + 
   k^4*NN*λ^2*σ*Φ0^3 - 
   2*c0*k^2*NN*α1*λ^2*σ*Φ0^3 - 
   4*c0*k^2*NN*α2*λ^2*σ*Φ0^3 + 
   k^4*NN*λ^2*σ^2*Φ0^3 - 
   2*c0*k^2*NN*α1*λ^2*σ^2*Φ0^3 + 
   2*k^2*NN*α2*λ^2*σ^2*Φ0^3 - 
   8*c0*k^2*NN*α2*λ^2*σ^2*Φ0^3 + 
   NN*σ^3*Φ0^3 + NN*σ^4*Φ0^3 - 
   2*k^2*NN*α2*λ^2*σ^2*Φ0^4 - 
   2*k^2*NN*α2*λ^2*σ^3*Φ0^4 + 
   2*c0*k^2*NN*λ^2*Φ0*χ - 
   4*c0^2*k^2*NN*λ^2*Φ0*χ - 
   2*c0*k^2*NN*λ^2*Φ0^2*χ + 
   2*k^2*NN*λ^2*σ*Φ0^2*χ - 
   6*c0*k^2*NN*λ^2*σ*Φ0^2*χ - 
   2*k^2*NN*λ^2*σ*Φ0^3*χ - 
   2*k^2*NN*λ^2*σ^2*Φ0^3*χ)*(-2*c0^2*
Ds*k^2 + 4*c0^3*Ds*k^2 - 2*c0^2*Ds^2*k^2*NN + 4*c0^3*Ds^2*k^2*NN - 
   2*c0*Ds*k^4*λ^2 + 2*c0^2*Ds*k^4*λ^2 - 
   c0*Ds^2*k^4*NN*λ^2 + 2*c0^2*Ds*k^2*Φ0 - 
   2*c0^2*Ds*k^2*NN*Φ0 + 2*c0^2*Ds^2*k^2*NN*Φ0 - 
   2*c0^2*Ds*k^4*NN*Φ0 + 4*c0^3*Ds*k^4*NN*Φ0 + 
   4*c0^3*Ds*k^2*NN*α1*Φ0 - 
   8*c0^4*Ds*k^2*NN*α1*Φ0 + 
   4*c0^3*Ds*k^2*NN*α2*Φ0 - 
   8*c0^4*Ds*k^2*NN*α2*Φ0 + 
   2*c0*Ds*k^4*λ^2*Φ0 - 
   2*c0*Ds*k^4*NN*λ^2*Φ0 + 
   c0*Ds^2*k^4*NN*λ^2*Φ0 - 
   2*c0*Ds*k^6*NN*λ^2*Φ0 + 
   2*c0^2*Ds*k^6*NN*λ^2*Φ0 + 
   4*c0^2*Ds*k^4*NN*α1*λ^2*Φ0 - 
   4*c0^3*Ds*k^4*NN*α1*λ^2*Φ0 + 
   4*c0^2*Ds*k^4*NN*α2*λ^2*Φ0 - 
   4*c0^3*Ds*k^4*NN*α2*λ^2*Φ0 - 
   2*c0*Ds*k^2*σ*Φ0 + 
   6*c0^2*Ds*k^2*σ*Φ0 + 
   4*c0^2*Ds*k^2*NN*σ*Φ0 - 
   c0*Ds^2*k^2*NN*σ*Φ0 + 
   4*c0^2*Ds^2*k^2*NN*σ*Φ0 - 
   Ds*k^4*λ^2*σ*Φ0 + 
   2*c0*Ds*k^4*λ^2*σ*Φ0 - 
   2*c0*Ds*k^2*NN*σ^2*Φ0 + 
   2*c0^2*Ds*k^2*NN*σ^2*Φ0 + 
   2*c0^2*Ds*k^4*NN*Φ0^2 - 
   4*c0^3*Ds*k^2*NN*α1*Φ0^2 - 
   4*c0^3*Ds*k^2*NN*α2*Φ0^2 + 
   2*c0*Ds*k^6*NN*λ^2*Φ0^2 - 
   8*c0^2*Ds*k^4*NN*α1*λ^2*Φ0^2 - 
   8*c0^2*Ds*k^4*NN*α2*λ^2*Φ0^2 + 
   2*c0*Ds*k^2*σ*Φ0^2 - 
   2*c0*Ds*k^2*NN*σ*Φ0^2 + 
   c0*Ds^2*k^2*NN*σ*Φ0^2 - 
   2*c0*Ds*k^4*NN*σ*Φ0^2 + 
   6*c0^2*Ds*k^4*NN*σ*Φ0^2 - 
   4*c0^3*Ds*k^2*NN*α1*σ*Φ0^2 + 
   4*c0^2*Ds*k^2*NN*α2*σ*Φ0^2 - 
   12*c0^3*Ds*k^2*NN*α2*σ*Φ0^2 + 
   Ds*k^4*λ^2*σ*Φ0^2 - 
   Ds*k^4*NN*λ^2*σ*Φ0^2 - 
   Ds*k^6*NN*λ^2*σ*Φ0^2 + 
   2*c0*Ds*k^6*NN*λ^2*σ*Φ0^2 + 
   2*c0*Ds*k^4*NN*α1*λ^2*σ*Φ0^2 - 
   4*c0^2*Ds*k^4*NN*α1*λ^2*σ*Φ0^2 + 
   6*c0*Ds*k^4*NN*α2*λ^2*σ*Φ0^2 - 
   8*c0^2*Ds*k^4*NN*α2*λ^2*σ*Φ0^2 + 
   2*c0*Ds*k^2*σ^2*Φ0^2 + 
   6*c0*Ds*k^2*NN*σ^2*Φ0^2 + 
   c0*Ds^2*k^2*NN*σ^2*Φ0^2 + 
   Ds*k^4*λ^2*σ^2*Φ0^2 - 
   Ds*k^2*NN*σ^3*Φ0^2 + 
   2*c0*Ds*k^2*NN*σ^3*Φ0^2 + 
   4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^3 - 
   8*c0^3*Ds*k^4*NN*α1^2*λ^2*Φ0^3 + 
   4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^3 - 
   8*c0^3*Ds*k^4*NN*α2^2*λ^2*Φ0^3 + 
   2*c0*Ds*k^4*NN*σ*Φ0^3 - 
   4*c0^2*Ds*k^2*NN*α2*σ*Φ0^3 + 
   Ds*k^6*NN*λ^2*σ*Φ0^3 - 
   6*c0*Ds*k^4*NN*α1*λ^2*σ*Φ0^3 - 
   10*c0*Ds*k^4*NN*α2*λ^2*σ*Φ0^3 + 
   2*c0*Ds*k^4*NN*σ^2*Φ0^3 - 
   4*c0*Ds*k^2*NN*α1*σ^2*Φ0^3 + 
   8*c0^2*Ds*k^2*NN*α1*σ^2*Φ0^3 - 
   4*c0^2*Ds*k^2*NN*α2*σ^2*Φ0^3 + 
   Ds*k^6*NN*λ^2*σ^2*Φ0^3 - 
   2*c0*Ds*k^4*NN*α1*λ^2*σ^2*Φ0^3 + 
   2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^3 - 
   6*c0*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^3 + 
   Ds*k^2*NN*σ^3*Φ0^3 + 
   Ds*k^2*NN*σ^4*Φ0^3 - 
   4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^4 - 
   4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^4 + 
   4*c0*Ds*k^4*NN*α1^2*λ^2*σ*Φ0^4 - 
   12*c0^2*Ds*k^4*NN*α1^2*λ^2*σ*Φ0^4*
+ 4*c0*Ds*k^4*NN*α2^2*λ^2*σ*Φ0^4 - 
   12*c0^2*Ds*k^4*NN*α2^2*λ^2*σ*Φ0^4*
+ 4*c0*Ds*k^2*NN*α1*σ^2*Φ0^4 - 
   2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^4 + 
   4*c0*Ds*k^2*NN*α1*σ^3*Φ0^4 - 
   2*Ds*k^4*NN*α2*λ^2*σ^3*Φ0^4 - 
   4*c0*Ds*k^4*NN*α1^2*λ^2*σ*Φ0^5 - 
   4*c0*Ds*k^4*NN*α2^2*λ^2*σ*Φ0^5 - 
   4*c0*Ds*k^4*NN*α1^2*λ^2*σ^2*Φ0^5*
- 4*c0*Ds*k^4*NN*α2^2*λ^2*σ^2*Φ0^5 + 
   4*c0^2*Ds*k^2*NN*Φ0*χ - 
   8*c0^3*Ds*k^2*NN*Φ0*χ + 
   4*c0*Ds*k^4*NN*λ^2*Φ0*χ - 
   4*c0^2*Ds*k^4*NN*λ^2*Φ0*χ - 
   4*c0^2*Ds*k^2*NN*Φ0^2*χ - 
   4*c0*Ds*k^4*NN*λ^2*Φ0^2*χ + 
   4*c0*Ds*k^2*NN*σ*Φ0^2*χ - 
   12*c0^2*Ds*k^2*NN*σ*Φ0^2*χ + 
   2*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
   4*c0*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
   4*c0*Ds*k^2*NN*σ*Φ0^3*χ - 
   2*Ds*k^4*NN*λ^2*σ*Φ0^3*χ - 
   4*c0*Ds*k^2*NN*σ^2*Φ0^3*χ - 
   2*Ds*k^4*NN*λ^2*σ^2*Φ0^3*χ) + 
safesqrt(4*(-(-2*c0^2*Ds*NN + 4*c0^3*Ds*NN - c0*k^2*λ^2 + 
         2*c0^2*k^2*λ^2 - 2*c0*Ds*k^2*NN*λ^2 + 
         2*c0^2*Ds*k^2*NN*λ^2 + 2*c0^2*Ds*NN*Φ0 + 
         c0*k^2*λ^2*Φ0 - 
         c0*k^2*NN*λ^2*Φ0 + 
         2*c0*Ds*k^2*NN*λ^2*Φ0 - 
         c0*k^4*NN*λ^2*Φ0 + 
         2*c0^2*k^4*NN*λ^2*Φ0 + 
         2*c0^2*k^2*NN*α1*λ^2*Φ0 - 
         4*c0^3*k^2*NN*α1*λ^2*Φ0 + 
         2*c0^2*k^2*NN*α2*λ^2*Φ0 - 
         4*c0^3*k^2*NN*α2*λ^2*Φ0 - 
         2*c0*Ds*NN*σ*Φ0 + 
         6*c0^2*Ds*NN*σ*Φ0 - 
         k^2*λ^2*σ*Φ0 + 
         3*c0*k^2*λ^2*σ*Φ0 - 
         Ds*k^2*NN*λ^2*σ*Φ0 + 
         2*c0*Ds*k^2*NN*λ^2*σ*Φ0 - 
         c0*NN*σ^2*Φ0 + 
         2*c0^2*NN*σ^2*Φ0 + 
         c0*k^4*NN*λ^2*Φ0^2 - 
         2*c0^2*k^2*NN*α1*λ^2*Φ0^2 - 
         2*c0^2*k^2*NN*α2*λ^2*Φ0^2 + 
         2*c0*Ds*NN*σ*Φ0^2 + 
         k^2*λ^2*σ*Φ0^2 - 
         k^2*NN*λ^2*σ*Φ0^2 + 
         Ds*k^2*NN*λ^2*σ*Φ0^2 - 
         k^4*NN*λ^2*σ*Φ0^2 + 
         3*c0*k^4*NN*λ^2*σ*Φ0^2 + 
         2*c0*k^2*NN*α1*λ^2*σ*Φ0^2 - 
         6*c0^2*k^2*NN*α1*λ^2*σ*Φ0^2*
+ 4*c0*k^2*NN*α2*λ^2*σ*Φ0^2 - 
         10*c0^2*k^2*NN*α2*λ^2*σ*
Φ0^2 + c0*NN*σ^2*Φ0^2 + 
         2*c0*Ds*NN*σ^2*Φ0^2 + 
         k^2*λ^2*σ^2*Φ0^2 + 
         Ds*k^2*NN*λ^2*σ^2*Φ0^2 - 
         NN*σ^3*Φ0^2 + 
         3*c0*NN*σ^3*Φ0^2 + 
         k^4*NN*λ^2*σ*Φ0^3 - 
         2*c0*k^2*NN*α1*λ^2*σ*Φ0^3 - 
         4*c0*k^2*NN*α2*λ^2*σ*Φ0^3 + 
         k^4*NN*λ^2*σ^2*Φ0^3 - 
         2*c0*k^2*NN*α1*λ^2*σ^2*Φ0^3*
+ 2*k^2*NN*α2*λ^2*σ^2*Φ0^3 - 
         8*c0*k^2*NN*α2*λ^2*σ^2*Φ0^3*
+ NN*σ^3*Φ0^3 + NN*σ^4*Φ0^3 - 
         2*k^2*NN*α2*λ^2*σ^2*Φ0^4 - 
         2*k^2*NN*α2*λ^2*σ^3*Φ0^4 + 
         2*c0*k^2*NN*λ^2*Φ0*χ - 
         4*c0^2*k^2*NN*λ^2*Φ0*χ - 
         2*c0*k^2*NN*λ^2*Φ0^2*χ + 
         2*k^2*NN*λ^2*σ*Φ0^2*χ - 
         6*c0*k^2*NN*λ^2*σ*Φ0^2*χ - 
         2*k^2*NN*λ^2*σ*Φ0^3*χ - 
         2*k^2*NN*λ^2*σ^2*Φ0^3*χ)^2 + 
       3*(-c0*NN*λ^2 + 2*c0^2*NN*λ^2 + 
         c0*NN*λ^2*Φ0 - 
         NN*λ^2*σ*Φ0 + 
         3*c0*NN*λ^2*σ*Φ0 + 
         NN*λ^2*σ*Φ0^2 + 
         NN*λ^2*σ^2*Φ0^2)*(-2*c0^2*Ds*k^2 + 
         4*c0^3*Ds*k^2 - 2*c0^2*Ds^2*k^2*NN + 
         4*c0^3*Ds^2*k^2*NN - 2*c0*Ds*k^4*λ^2 + 
         2*c0^2*Ds*k^4*λ^2 - 
         c0*Ds^2*k^4*NN*λ^2 + 2*c0^2*Ds*k^2*Φ0 - 
         2*c0^2*Ds*k^2*NN*Φ0 + 
         2*c0^2*Ds^2*k^2*NN*Φ0 - 
         2*c0^2*Ds*k^4*NN*Φ0 + 4*c0^3*Ds*k^4*NN*Φ0 + 
         4*c0^3*Ds*k^2*NN*α1*Φ0 - 
         8*c0^4*Ds*k^2*NN*α1*Φ0 + 
         4*c0^3*Ds*k^2*NN*α2*Φ0 - 
         8*c0^4*Ds*k^2*NN*α2*Φ0 + 
         2*c0*Ds*k^4*λ^2*Φ0 - 
         2*c0*Ds*k^4*NN*λ^2*Φ0 + 
         c0*Ds^2*k^4*NN*λ^2*Φ0 - 
         2*c0*Ds*k^6*NN*λ^2*Φ0 + 
         2*c0^2*Ds*k^6*NN*λ^2*Φ0 + 
         4*c0^2*Ds*k^4*NN*α1*λ^2*Φ0 - 
         4*c0^3*Ds*k^4*NN*α1*λ^2*Φ0 + 
         4*c0^2*Ds*k^4*NN*α2*λ^2*Φ0 - 
         4*c0^3*Ds*k^4*NN*α2*λ^2*Φ0 - 
         2*c0*Ds*k^2*σ*Φ0 + 
         6*c0^2*Ds*k^2*σ*Φ0 + 
         4*c0^2*Ds*k^2*NN*σ*Φ0 - 
         c0*Ds^2*k^2*NN*σ*Φ0 + 
         4*c0^2*Ds^2*k^2*NN*σ*Φ0 - 
         Ds*k^4*λ^2*σ*Φ0 + 
         2*c0*Ds*k^4*λ^2*σ*Φ0 - 
         2*c0*Ds*k^2*NN*σ^2*Φ0 + 
         2*c0^2*Ds*k^2*NN*σ^2*Φ0 + 
         2*c0^2*Ds*k^4*NN*Φ0^2 - 
         4*c0^3*Ds*k^2*NN*α1*Φ0^2 - 
         4*c0^3*Ds*k^2*NN*α2*Φ0^2 + 
         2*c0*Ds*k^6*NN*λ^2*Φ0^2 - 
         8*c0^2*Ds*k^4*NN*α1*λ^2*Φ0^2 - 
         8*c0^2*Ds*k^4*NN*α2*λ^2*Φ0^2 + 
         2*c0*Ds*k^2*σ*Φ0^2 - 
         2*c0*Ds*k^2*NN*σ*Φ0^2 + 
         c0*Ds^2*k^2*NN*σ*Φ0^2 - 
         2*c0*Ds*k^4*NN*σ*Φ0^2 + 
         6*c0^2*Ds*k^4*NN*σ*Φ0^2 - 
         4*c0^3*Ds*k^2*NN*α1*σ*Φ0^2 + 
         4*c0^2*Ds*k^2*NN*α2*σ*Φ0^2 - 
         12*c0^3*Ds*k^2*NN*α2*σ*Φ0^2 + 
         Ds*k^4*λ^2*σ*Φ0^2 - 
         Ds*k^4*NN*λ^2*σ*Φ0^2 - 
         Ds*k^6*NN*λ^2*σ*Φ0^2 + 
         2*c0*Ds*k^6*NN*λ^2*σ*Φ0^2 + 
         2*c0*Ds*k^4*NN*α1*λ^2*σ*
Φ0^2 - 
         4*c0^2*Ds*k^4*NN*α1*λ^2*σ*
Φ0^2 + 6*c0*Ds*k^4*NN*α2*λ^2*σ*Φ0^2 - 
         8*c0^2*Ds*k^4*NN*α2*λ^2*σ*
Φ0^2 + 2*c0*Ds*k^2*σ^2*Φ0^2 + 
         6*c0*Ds*k^2*NN*σ^2*Φ0^2 + 
         c0*Ds^2*k^2*NN*σ^2*Φ0^2 + 
         Ds*k^4*λ^2*σ^2*Φ0^2 - 
         Ds*k^2*NN*σ^3*Φ0^2 + 
         2*c0*Ds*k^2*NN*σ^3*Φ0^2 + 
         4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^3 - 
         8*c0^3*Ds*k^4*NN*α1^2*λ^2*Φ0^3 + 
         4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^3 - 
         8*c0^3*Ds*k^4*NN*α2^2*λ^2*Φ0^3 + 
         2*c0*Ds*k^4*NN*σ*Φ0^3 - 
         4*c0^2*Ds*k^2*NN*α2*σ*Φ0^3 + 
         Ds*k^6*NN*λ^2*σ*Φ0^3 - 
         6*c0*Ds*k^4*NN*α1*λ^2*σ*
Φ0^3 - 
         10*c0*Ds*k^4*NN*α2*λ^2*σ*
Φ0^3 + 2*c0*Ds*k^4*NN*σ^2*Φ0^3 - 
         4*c0*Ds*k^2*NN*α1*σ^2*Φ0^3 + 
         8*c0^2*Ds*k^2*NN*α1*σ^2*Φ0^3 - 
         4*c0^2*Ds*k^2*NN*α2*σ^2*Φ0^3 + 
         Ds*k^6*NN*λ^2*σ^2*Φ0^3 - 
         2*c0*Ds*k^4*NN*α1*λ^2*σ^2*
Φ0^3 + 2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^3 - 
         6*c0*Ds*k^4*NN*α2*λ^2*σ^2*
Φ0^3 + Ds*k^2*NN*σ^3*Φ0^3 + 
         Ds*k^2*NN*σ^4*Φ0^3 - 
         4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^4 - 
         4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^4 + 
         4*c0*Ds*k^4*NN*α1^2*λ^2*σ*
Φ0^4 - 
         12*c0^2*Ds*k^4*NN*α1^2*λ^2*σ*
Φ0^4 + 
         4*c0*Ds*k^4*NN*α2^2*λ^2*σ*
Φ0^4 - 
         12*c0^2*Ds*k^4*NN*α2^2*λ^2*σ*
Φ0^4 + 4*c0*Ds*k^2*NN*α1*σ^2*Φ0^4 - 
         2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^4*
+ 4*c0*Ds*k^2*NN*α1*σ^3*Φ0^4 - 
         2*Ds*k^4*NN*α2*λ^2*σ^3*Φ0^4*
- 4*c0*Ds*k^4*NN*α1^2*λ^2*σ*Φ0^5 - 
         4*c0*Ds*k^4*NN*α2^2*λ^2*σ*
Φ0^5 - 
         4*c0*Ds*k^4*NN*α1^2*λ^2*σ^2*
Φ0^5 - 
         4*c0*Ds*k^4*NN*α2^2*λ^2*σ^2*
Φ0^5 + 4*c0^2*Ds*k^2*NN*Φ0*χ - 
         8*c0^3*Ds*k^2*NN*Φ0*χ + 
         4*c0*Ds*k^4*NN*λ^2*Φ0*χ - 
         4*c0^2*Ds*k^4*NN*λ^2*Φ0*χ - 
         4*c0^2*Ds*k^2*NN*Φ0^2*χ - 
         4*c0*Ds*k^4*NN*λ^2*Φ0^2*χ + 
         4*c0*Ds*k^2*NN*σ*Φ0^2*χ - 
         12*c0^2*Ds*k^2*NN*σ*Φ0^2*χ + 
         2*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
         4*c0*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
         4*c0*Ds*k^2*NN*σ*Φ0^3*χ - 
         2*Ds*k^4*NN*λ^2*σ*Φ0^3*χ - 
         4*c0*Ds*k^2*NN*σ^2*Φ0^3*χ - 
         2*Ds*k^4*NN*λ^2*σ^2*Φ0^3*
χ))^3 + (-27*(-c0*NN*λ^2 + 2*c0^2*NN*λ^2 + 
        c0*NN*λ^2*Φ0 - 
        NN*λ^2*σ*Φ0 + 
        3*c0*NN*λ^2*σ*Φ0 + 
        NN*λ^2*σ*Φ0^2 + 
        NN*λ^2*σ^2*Φ0^2)^2*(-2*c0^2*Ds^2*
k^4 + 4*c0^3*Ds^2*k^4 - c0*Ds^2*k^6*λ^2 + 
        2*c0^2*Ds^2*k^4*Φ0 - 2*c0^2*Ds^2*k^4*NN*Φ0 - 
        2*c0^2*Ds^2*k^6*NN*Φ0 + 
        4*c0^3*Ds^2*k^6*NN*Φ0 + 
        4*c0^3*Ds^2*k^4*NN*α1*Φ0 - 
        8*c0^4*Ds^2*k^4*NN*α1*Φ0 + 
        4*c0^3*Ds^2*k^4*NN*α2*Φ0 - 
        8*c0^4*Ds^2*k^4*NN*α2*Φ0 + 
        c0*Ds^2*k^6*λ^2*Φ0 - 
        c0*Ds^2*k^6*NN*λ^2*Φ0 - 
        c0*Ds^2*k^8*NN*λ^2*Φ0 + 
        2*c0^2*Ds^2*k^6*NN*α1*λ^2*Φ0 + 
        2*c0^2*Ds^2*k^6*NN*α2*λ^2*Φ0 - 
        c0*Ds^2*k^4*σ*Φ0 + 
        4*c0^2*Ds^2*k^4*σ*Φ0 + 
        4*c0^2*Ds^2*k^4*NN*σ*Φ0 - 
        c0*Ds^2*k^4*NN*σ^2*Φ0 + 
        2*c0^2*Ds^2*k^6*NN*Φ0^2 - 
        4*c0^3*Ds^2*k^4*NN*α1*Φ0^2 - 
        4*c0^3*Ds^2*k^4*NN*α2*Φ0^2 + 
        c0*Ds^2*k^8*NN*λ^2*Φ0^2 - 
        6*c0^2*Ds^2*k^6*NN*α1*λ^2*Φ0^2 - 
        6*c0^2*Ds^2*k^6*NN*α2*λ^2*Φ0^2 + 
        c0*Ds^2*k^4*σ*Φ0^2 - 
        c0*Ds^2*k^4*NN*σ*Φ0^2 - 
        c0*Ds^2*k^6*NN*σ*Φ0^2 + 
        4*c0^2*Ds^2*k^6*NN*σ*Φ0^2 - 
        2*c0^2*Ds^2*k^4*NN*α1*σ*Φ0^2 + 
        2*c0^2*Ds^2*k^4*NN*α2*σ*Φ0^2 - 
        8*c0^3*Ds^2*k^4*NN*α2*σ*Φ0^2 + 
        2*c0*Ds^2*k^6*NN*α2*λ^2*σ*
Φ0^2 + c0*Ds^2*k^4*σ^2*Φ0^2 + 
        3*c0*Ds^2*k^4*NN*σ^2*Φ0^2 + 
        4*c0^3*Ds^2*k^4*NN*α1^2*Φ0^3 - 
        8*c0^4*Ds^2*k^4*NN*α1^2*Φ0^3 - 
        8*c0^3*Ds^2*k^4*NN*α1*α2*Φ0^3 + 
        16*c0^4*Ds^2*k^4*NN*α1*α2*Φ0^3 + 
        4*c0^3*Ds^2*k^4*NN*α2^2*Φ0^3 - 
        8*c0^4*Ds^2*k^4*NN*α2^2*Φ0^3 + 
        4*c0^2*Ds^2*k^6*NN*α1^2*λ^2*Φ0^3 - 
        4*c0^3*Ds^2*k^6*NN*α1^2*λ^2*Φ0^3 - 
        8*c0^3*Ds^2*k^6*NN*α1*α2*λ^2*
Φ0^3 + 4*c0^2*Ds^2*k^6*NN*α2^2*λ^2*Φ0^3 - 
        4*c0^3*Ds^2*k^6*NN*α2^2*λ^2*Φ0^3 + 
        c0*Ds^2*k^6*NN*σ*Φ0^3 + 
        2*c0^2*Ds^2*k^4*NN*α1*σ*Φ0^3 - 
        2*c0^2*Ds^2*k^4*NN*α2*σ*Φ0^3 - 
        6*c0*Ds^2*k^6*NN*α2*λ^2*σ*
Φ0^3 + c0*Ds^2*k^6*NN*σ^2*Φ0^3 + 
        2*c0^2*Ds^2*k^4*NN*α1*σ^2*Φ0^3 - 
        2*c0*Ds^2*k^4*NN*α2*σ^2*Φ0^3 + 
        2*c0^2*Ds^2*k^4*NN*α2*σ^2*Φ0^3 - 
        4*c0^3*Ds^2*k^4*NN*α1^2*Φ0^4 + 
        8*c0^3*Ds^2*k^4*NN*α1*α2*Φ0^4 - 
        4*c0^3*Ds^2*k^4*NN*α2^2*Φ0^4 - 
        4*c0^2*Ds^2*k^6*NN*α1^2*λ^2*Φ0^4 - 
        4*c0^2*Ds^2*k^6*NN*α2^2*λ^2*Φ0^4 + 
        4*c0^2*Ds^2*k^4*NN*α1^2*σ*Φ0^4 - 
        12*c0^3*Ds^2*k^4*NN*α1^2*σ*Φ0^4 - 
        8*c0^2*Ds^2*k^4*NN*α1*α2*σ*
Φ0^4 + 
        24*c0^3*Ds^2*k^4*NN*α1*α2*σ*
Φ0^4 + 4*c0^2*Ds^2*k^4*NN*α2^2*σ*Φ0^4 - 
        12*c0^3*Ds^2*k^4*NN*α2^2*σ*Φ0^4 - 
        8*c0^2*Ds^2*k^6*NN*α1*α2*λ^2*
σ*Φ0^4 + 
        4*c0*Ds^2*k^6*NN*α2^2*λ^2*σ*
Φ0^4 - 
        8*c0^2*Ds^2*k^6*NN*α2^2*λ^2*σ*
Φ0^4 + 2*c0*Ds^2*k^4*NN*α2*σ^2*Φ0^4 + 
        2*c0*Ds^2*k^4*NN*α2*σ^3*Φ0^4 - 
        4*c0^2*Ds^2*k^4*NN*α1^2*σ*Φ0^5 + 
        8*c0^2*Ds^2*k^4*NN*α1*α2*σ*
Φ0^5 - 4*c0^2*Ds^2*k^4*NN*α2^2*σ*Φ0^5 - 
        4*c0*Ds^2*k^6*NN*α2^2*λ^2*σ*
Φ0^5 - 4*c0^2*Ds^2*k^4*NN*α1^2*σ^2*Φ0^5 + 
        8*c0^2*Ds^2*k^4*NN*α1*α2*σ^2*
Φ0^5 - 4*c0^2*Ds^2*k^4*NN*α2^2*σ^2*Φ0^5 - 
        4*c0*Ds^2*k^6*NN*α2^2*λ^2*σ^2*
Φ0^5 + 4*c0^2*Ds^2*k^4*NN*Φ0*χ - 
        8*c0^3*Ds^2*k^4*NN*Φ0*χ + 
        2*c0*Ds^2*k^6*NN*λ^2*Φ0*χ - 
        4*c0^2*Ds^2*k^4*NN*Φ0^2*χ - 
        2*c0*Ds^2*k^6*NN*λ^2*Φ0^2*χ + 
        2*c0*Ds^2*k^4*NN*σ*Φ0^2*χ - 
        8*c0^2*Ds^2*k^4*NN*σ*Φ0^2*χ - 
        2*c0*Ds^2*k^4*NN*σ*Φ0^3*χ - 
        2*c0*Ds^2*k^4*NN*σ^2*Φ0^3*χ) - 
      2*(-2*c0^2*Ds*NN + 4*c0^3*Ds*NN - c0*k^2*λ^2 + 
        2*c0^2*k^2*λ^2 - 2*c0*Ds*k^2*NN*λ^2 + 
        2*c0^2*Ds*k^2*NN*λ^2 + 2*c0^2*Ds*NN*Φ0 + 
        c0*k^2*λ^2*Φ0 - 
        c0*k^2*NN*λ^2*Φ0 + 
        2*c0*Ds*k^2*NN*λ^2*Φ0 - 
        c0*k^4*NN*λ^2*Φ0 + 
        2*c0^2*k^4*NN*λ^2*Φ0 + 
        2*c0^2*k^2*NN*α1*λ^2*Φ0 - 
        4*c0^3*k^2*NN*α1*λ^2*Φ0 + 
        2*c0^2*k^2*NN*α2*λ^2*Φ0 - 
        4*c0^3*k^2*NN*α2*λ^2*Φ0 - 
        2*c0*Ds*NN*σ*Φ0 + 
        6*c0^2*Ds*NN*σ*Φ0 - 
        k^2*λ^2*σ*Φ0 + 
        3*c0*k^2*λ^2*σ*Φ0 - 
        Ds*k^2*NN*λ^2*σ*Φ0 + 
        2*c0*Ds*k^2*NN*λ^2*σ*Φ0 - 
        c0*NN*σ^2*Φ0 + 
        2*c0^2*NN*σ^2*Φ0 + 
        c0*k^4*NN*λ^2*Φ0^2 - 
        2*c0^2*k^2*NN*α1*λ^2*Φ0^2 - 
        2*c0^2*k^2*NN*α2*λ^2*Φ0^2 + 
        2*c0*Ds*NN*σ*Φ0^2 + 
        k^2*λ^2*σ*Φ0^2 - 
        k^2*NN*λ^2*σ*Φ0^2 + 
        Ds*k^2*NN*λ^2*σ*Φ0^2 - 
        k^4*NN*λ^2*σ*Φ0^2 + 
        3*c0*k^4*NN*λ^2*σ*Φ0^2 + 
        2*c0*k^2*NN*α1*λ^2*σ*Φ0^2 - 
        6*c0^2*k^2*NN*α1*λ^2*σ*Φ0^2*
+ 4*c0*k^2*NN*α2*λ^2*σ*Φ0^2 - 
        10*c0^2*k^2*NN*α2*λ^2*σ*Φ0^2*
+ c0*NN*σ^2*Φ0^2 + 2*c0*Ds*NN*σ^2*Φ0^2 + 
        k^2*λ^2*σ^2*Φ0^2 + 
        Ds*k^2*NN*λ^2*σ^2*Φ0^2 - 
        NN*σ^3*Φ0^2 + 3*c0*NN*σ^3*Φ0^2*+
         k^4*NN*λ^2*σ*Φ0^3 - 
        2*c0*k^2*NN*α1*λ^2*σ*Φ0^3 - 
        4*c0*k^2*NN*α2*λ^2*σ*Φ0^3 + 
        k^4*NN*λ^2*σ^2*Φ0^3 - 
        2*c0*k^2*NN*α1*λ^2*σ^2*Φ0^3*
+ 2*k^2*NN*α2*λ^2*σ^2*Φ0^3 - 
        8*c0*k^2*NN*α2*λ^2*σ^2*Φ0^3*+
         NN*σ^3*Φ0^3 + NN*σ^4*Φ0^3 - 
        2*k^2*NN*α2*λ^2*σ^2*Φ0^4 - 
        2*k^2*NN*α2*λ^2*σ^3*Φ0^4 + 
        2*c0*k^2*NN*λ^2*Φ0*χ - 
        4*c0^2*k^2*NN*λ^2*Φ0*χ - 
        2*c0*k^2*NN*λ^2*Φ0^2*χ + 
        2*k^2*NN*λ^2*σ*Φ0^2*χ - 
        6*c0*k^2*NN*λ^2*σ*Φ0^2*χ - 
        2*k^2*NN*λ^2*σ*Φ0^3*χ - 
        2*k^2*NN*λ^2*σ^2*Φ0^3*χ)^3 + 
      9*(-c0*NN*λ^2 + 2*c0^2*NN*λ^2 + 
        c0*NN*λ^2*Φ0 - 
        NN*λ^2*σ*Φ0 + 
        3*c0*NN*λ^2*σ*Φ0 + 
        NN*λ^2*σ*Φ0^2 + 
        NN*λ^2*σ^2*Φ0^2)*(-2*c0^2*Ds*NN + 
        4*c0^3*Ds*NN - c0*k^2*λ^2 + 
        2*c0^2*k^2*λ^2 - 2*c0*Ds*k^2*NN*λ^2 + 
        2*c0^2*Ds*k^2*NN*λ^2 + 2*c0^2*Ds*NN*Φ0 + 
        c0*k^2*λ^2*Φ0 - 
        c0*k^2*NN*λ^2*Φ0 + 
        2*c0*Ds*k^2*NN*λ^2*Φ0 - 
        c0*k^4*NN*λ^2*Φ0 + 
        2*c0^2*k^4*NN*λ^2*Φ0 + 
        2*c0^2*k^2*NN*α1*λ^2*Φ0 - 
        4*c0^3*k^2*NN*α1*λ^2*Φ0 + 
        2*c0^2*k^2*NN*α2*λ^2*Φ0 - 
        4*c0^3*k^2*NN*α2*λ^2*Φ0 - 
        2*c0*Ds*NN*σ*Φ0 + 
        6*c0^2*Ds*NN*σ*Φ0 - 
        k^2*λ^2*σ*Φ0 + 
        3*c0*k^2*λ^2*σ*Φ0 - 
        Ds*k^2*NN*λ^2*σ*Φ0 + 
        2*c0*Ds*k^2*NN*λ^2*σ*Φ0 - 
        c0*NN*σ^2*Φ0 + 
        2*c0^2*NN*σ^2*Φ0 + 
        c0*k^4*NN*λ^2*Φ0^2 - 
        2*c0^2*k^2*NN*α1*λ^2*Φ0^2 - 
        2*c0^2*k^2*NN*α2*λ^2*Φ0^2 + 
        2*c0*Ds*NN*σ*Φ0^2 + 
        k^2*λ^2*σ*Φ0^2 - 
        k^2*NN*λ^2*σ*Φ0^2 + 
        Ds*k^2*NN*λ^2*σ*Φ0^2 - 
        k^4*NN*λ^2*σ*Φ0^2 + 
        3*c0*k^4*NN*λ^2*σ*Φ0^2 + 
        2*c0*k^2*NN*α1*λ^2*σ*Φ0^2 - 
        6*c0^2*k^2*NN*α1*λ^2*σ*Φ0^2*
+ 4*c0*k^2*NN*α2*λ^2*σ*Φ0^2 - 
        10*c0^2*k^2*NN*α2*λ^2*σ*Φ0^2*
+ c0*NN*σ^2*Φ0^2 + 2*c0*Ds*NN*σ^2*Φ0^2 + 
        k^2*λ^2*σ^2*Φ0^2 + 
        Ds*k^2*NN*λ^2*σ^2*Φ0^2 - 
        NN*σ^3*Φ0^2 + 3*c0*NN*σ^3*Φ0^2*+
         k^4*NN*λ^2*σ*Φ0^3 - 
        2*c0*k^2*NN*α1*λ^2*σ*Φ0^3 - 
        4*c0*k^2*NN*α2*λ^2*σ*Φ0^3 + 
        k^4*NN*λ^2*σ^2*Φ0^3 - 
        2*c0*k^2*NN*α1*λ^2*σ^2*Φ0^3*
+ 2*k^2*NN*α2*λ^2*σ^2*Φ0^3 - 
        8*c0*k^2*NN*α2*λ^2*σ^2*Φ0^3*+
         NN*σ^3*Φ0^3 + NN*σ^4*Φ0^3 - 
        2*k^2*NN*α2*λ^2*σ^2*Φ0^4 - 
        2*k^2*NN*α2*λ^2*σ^3*Φ0^4 + 
        2*c0*k^2*NN*λ^2*Φ0*χ - 
        4*c0^2*k^2*NN*λ^2*Φ0*χ - 
        2*c0*k^2*NN*λ^2*Φ0^2*χ + 
        2*k^2*NN*λ^2*σ*Φ0^2*χ - 
        6*c0*k^2*NN*λ^2*σ*Φ0^2*χ - 
        2*k^2*NN*λ^2*σ*Φ0^3*χ - 
        2*k^2*NN*λ^2*σ^2*Φ0^3*χ)*(-2*
c0^2*Ds*k^2 + 4*c0^3*Ds*k^2 - 2*c0^2*Ds^2*k^2*NN + 
        4*c0^3*Ds^2*k^2*NN - 2*c0*Ds*k^4*λ^2 + 
        2*c0^2*Ds*k^4*λ^2 - 
        c0*Ds^2*k^4*NN*λ^2 + 2*c0^2*Ds*k^2*Φ0 - 
        2*c0^2*Ds*k^2*NN*Φ0 + 2*c0^2*Ds^2*k^2*NN*Φ0 - 
        2*c0^2*Ds*k^4*NN*Φ0 + 4*c0^3*Ds*k^4*NN*Φ0 + 
        4*c0^3*Ds*k^2*NN*α1*Φ0 - 
        8*c0^4*Ds*k^2*NN*α1*Φ0 + 
        4*c0^3*Ds*k^2*NN*α2*Φ0 - 
        8*c0^4*Ds*k^2*NN*α2*Φ0 + 
        2*c0*Ds*k^4*λ^2*Φ0 - 
        2*c0*Ds*k^4*NN*λ^2*Φ0 + 
        c0*Ds^2*k^4*NN*λ^2*Φ0 - 
        2*c0*Ds*k^6*NN*λ^2*Φ0 + 
        2*c0^2*Ds*k^6*NN*λ^2*Φ0 + 
        4*c0^2*Ds*k^4*NN*α1*λ^2*Φ0 - 
        4*c0^3*Ds*k^4*NN*α1*λ^2*Φ0 + 
        4*c0^2*Ds*k^4*NN*α2*λ^2*Φ0 - 
        4*c0^3*Ds*k^4*NN*α2*λ^2*Φ0 - 
        2*c0*Ds*k^2*σ*Φ0 + 
        6*c0^2*Ds*k^2*σ*Φ0 + 
        4*c0^2*Ds*k^2*NN*σ*Φ0 - 
        c0*Ds^2*k^2*NN*σ*Φ0 + 
        4*c0^2*Ds^2*k^2*NN*σ*Φ0 - 
        Ds*k^4*λ^2*σ*Φ0 + 
        2*c0*Ds*k^4*λ^2*σ*Φ0 - 
        2*c0*Ds*k^2*NN*σ^2*Φ0 + 
        2*c0^2*Ds*k^2*NN*σ^2*Φ0 + 
        2*c0^2*Ds*k^4*NN*Φ0^2 - 
        4*c0^3*Ds*k^2*NN*α1*Φ0^2 - 
        4*c0^3*Ds*k^2*NN*α2*Φ0^2 + 
        2*c0*Ds*k^6*NN*λ^2*Φ0^2 - 
        8*c0^2*Ds*k^4*NN*α1*λ^2*Φ0^2 - 
        8*c0^2*Ds*k^4*NN*α2*λ^2*Φ0^2 + 
        2*c0*Ds*k^2*σ*Φ0^2 - 
        2*c0*Ds*k^2*NN*σ*Φ0^2 + 
        c0*Ds^2*k^2*NN*σ*Φ0^2 - 
        2*c0*Ds*k^4*NN*σ*Φ0^2 + 
        6*c0^2*Ds*k^4*NN*σ*Φ0^2 - 
        4*c0^3*Ds*k^2*NN*α1*σ*Φ0^2 + 
        4*c0^2*Ds*k^2*NN*α2*σ*Φ0^2 - 
        12*c0^3*Ds*k^2*NN*α2*σ*Φ0^2 + 
        Ds*k^4*λ^2*σ*Φ0^2 - 
        Ds*k^4*NN*λ^2*σ*Φ0^2 - 
        Ds*k^6*NN*λ^2*σ*Φ0^2 + 
        2*c0*Ds*k^6*NN*λ^2*σ*Φ0^2 + 
        2*c0*Ds*k^4*NN*α1*λ^2*σ*Φ0^2*
- 4*c0^2*Ds*k^4*NN*α1*λ^2*σ*Φ0^2 + 
        6*c0*Ds*k^4*NN*α2*λ^2*σ*Φ0^2*
- 8*c0^2*Ds*k^4*NN*α2*λ^2*σ*Φ0^2 + 
        2*c0*Ds*k^2*σ^2*Φ0^2 + 
        6*c0*Ds*k^2*NN*σ^2*Φ0^2 + 
        c0*Ds^2*k^2*NN*σ^2*Φ0^2 + 
        Ds*k^4*λ^2*σ^2*Φ0^2 - 
        Ds*k^2*NN*σ^3*Φ0^2 + 
        2*c0*Ds*k^2*NN*σ^3*Φ0^2 + 
        4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^3 - 
        8*c0^3*Ds*k^4*NN*α1^2*λ^2*Φ0^3 + 
        4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^3 - 
        8*c0^3*Ds*k^4*NN*α2^2*λ^2*Φ0^3 + 
        2*c0*Ds*k^4*NN*σ*Φ0^3 - 
        4*c0^2*Ds*k^2*NN*α2*σ*Φ0^3 + 
        Ds*k^6*NN*λ^2*σ*Φ0^3 - 
        6*c0*Ds*k^4*NN*α1*λ^2*σ*Φ0^3*
- 10*c0*Ds*k^4*NN*α2*λ^2*σ*Φ0^3 + 
        2*c0*Ds*k^4*NN*σ^2*Φ0^3 - 
        4*c0*Ds*k^2*NN*α1*σ^2*Φ0^3 + 
        8*c0^2*Ds*k^2*NN*α1*σ^2*Φ0^3 - 
        4*c0^2*Ds*k^2*NN*α2*σ^2*Φ0^3 + 
        Ds*k^6*NN*λ^2*σ^2*Φ0^3 - 
        2*c0*Ds*k^4*NN*α1*λ^2*σ^2*
Φ0^3 + 2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^3 - 
        6*c0*Ds*k^4*NN*α2*λ^2*σ^2*
Φ0^3 + Ds*k^2*NN*σ^3*Φ0^3 + 
        Ds*k^2*NN*σ^4*Φ0^3 - 
        4*c0^2*Ds*k^4*NN*α1^2*λ^2*Φ0^4 - 
        4*c0^2*Ds*k^4*NN*α2^2*λ^2*Φ0^4 + 
        
        4*c0*Ds*k^4*NN*α1^2*λ^2*σ*
Φ0^4 - 
        12*c0^2*Ds*k^4*NN*α1^2*λ^2*σ*
Φ0^4 + 
        4*c0*Ds*k^4*NN*α2^2*λ^2*σ*
Φ0^4 - 
        12*c0^2*Ds*k^4*NN*α2^2*λ^2*σ*
Φ0^4 + 4*c0*Ds*k^2*NN*α1*σ^2*Φ0^4 - 
        2*Ds*k^4*NN*α2*λ^2*σ^2*Φ0^4*
+ 4*c0*Ds*k^2*NN*α1*σ^3*Φ0^4 - 
        2*Ds*k^4*NN*α2*λ^2*σ^3*Φ0^4*
- 4*c0*Ds*k^4*NN*α1^2*λ^2*σ*Φ0^5 - 
        4*c0*Ds*k^4*NN*α2^2*λ^2*σ*
Φ0^5 - 
        4*c0*Ds*k^4*NN*α1^2*λ^2*σ^2*
Φ0^5 - 
        4*c0*Ds*k^4*NN*α2^2*λ^2*σ^2*
Φ0^5 + 4*c0^2*Ds*k^2*NN*Φ0*χ - 
        8*c0^3*Ds*k^2*NN*Φ0*χ + 
        4*c0*Ds*k^4*NN*λ^2*Φ0*χ - 
        4*c0^2*Ds*k^4*NN*λ^2*Φ0*χ - 
        4*c0^2*Ds*k^2*NN*Φ0^2*χ - 
        4*c0*Ds*k^4*NN*λ^2*Φ0^2*χ + 
        4*c0*Ds*k^2*NN*σ*Φ0^2*χ - 
        12*c0^2*Ds*k^2*NN*σ*Φ0^2*χ + 
        2*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
        4*c0*Ds*k^4*NN*λ^2*σ*Φ0^2*χ - 
        4*c0*Ds*k^2*NN*σ*Φ0^3*χ - 
        2*Ds*k^4*NN*λ^2*σ*Φ0^3*χ - 
        4*c0*Ds*k^2*NN*σ^2*Φ0^3*χ - 
        2*Ds*k^4*NN*λ^2*σ^2*Φ0^3*
χ))^2))^(1/3))/(6*2^(
1/3)*(-c0*NN*λ^2 + 2*c0^2*NN*λ^2 + 
c0*NN*λ^2*Φ0 - NN*λ^2*σ*Φ0 + 
3*c0*NN*λ^2*σ*Φ0 + 
NN*λ^2*σ*Φ0^2 + 
NN*λ^2*σ^2*Φ0^2))
end

function safesqrt(x)
    if x<0
        return 0
    else
        return sqrt(x)
    end
end

k = range(0, 1.4, 100)
for k1 in k
    println(dispersion(k1, 15, 0.1, 0.001, 1.1, 0.1, 0.6, sqrt(15), 0, 0))
end

s = dispersion.(k, 15, 0.1, 0.001, 1.1, 0.1, 0.6, sqrt(15), 0, 0)
println("BREAK")
plot(k, s, ylims=(-0.03, 0.03))